[{"link":"https://www.rightmove.co.uk/properties/141859418#/?channel=RES_LET","address":"Indescon Square, Canary Wharf, London, E14","description":"When you get a spare moment, you will want to come and see this stunning Two Bedroom / Two Bathroom apartment.\n\nThe apartment sits in the Indescon Square development where you can sit back and enjoy the view from one of your two balconies. Enjoy your own paradise of comfort and modernity in the open plan kitchen and living room, where cooking and watching your favourite TV series goes hand in hand. \nNo more London box bedrooms for you, as the spacious bedroom allows you to wake up in style with floor to ceiling windows. Sometimes living in the city can be noisy, but living here offers a moment of rare tranquillity amongst the popular business districts, with no busy roads outside your door.\n\nThe local area provides you with close by shops as well as all the amenities Canary Wharf has to offer. The 24hr concierge are always on hand to help you collect parcels or even just to make you feel safe whilst walking around the development. Situated only 0.5 miles from Canary Wharf Tube station and 0.4 miles from South Quay DLR, commuting to work, whether you work in Canary Wharf itself or the City, is easy. \n\nDoes this sound like the perfect place for you? Give us a call on   to arrange a viewing while it is still fresh on the market.","title":"2 bedroom apartment","available":"16/11/2023","price":"£2,400 pcm","agency":"Life Residential, Canary Wharf Office - Lettings Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/53k/52518/141859418/52518_CWL230094_L_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141959414#/?channel=RES_LET","address":"New Providence Wharf, E14","description":"Overlooking the river, this stunning two bed apartment is situated on the sixteenth floor of the highly sought after dockside development, New Providence Wharf. Comprising two large double bedrooms, one en-suite bathroom and one family bathroom, a well-appointed, open-plan reception room and a well-fitted, modern kitchen. 24 hour concierge and security, Residents gym, 25m Swimming pool, jacuzzi, sauna and steam room. Close to Blackwall and East India DLR, and the cafes, bars, restaurants and shops of Canary Wharf are all within close proximity.","title":"2 bedroom apartment","available":"Ask agent","price":"£2,600 pcm","agency":"Henry Wiltshire, London Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/257k/256607/141959414/256607_15847_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141959201#/?channel=RES_LET","address":"Switch House, 4 Blackwall Way, East India Quays, Blackwall, London, E14 9QS","description":"Jack Barclay Estates are happy to offer this spacious 2 bedroom 2 bathroom luxury fully furnished apartment situated in Switch House\n\nComprising of a spacious dual aspect lounge with a private balcony, seperate fully fitted kitchen. two double bedrooms, master with en suite, guest bathroom.\n\nThe apartment is offered fully furnished with the added benefit of a concierge.\n\nIdeally located only moments from East India D.L.R.","title":"2 bedroom flat","available":"Ask agent","price":"£2,448 pcm","agency":"Jack Barclay Estates, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141959183#/?channel=RES_LET","address":"Proton Tower, 8 Blackwall Way, East India Dock, Canary Wharf, London, E14 9GP","description":"Jack Barclay Estates are happy to offer this fantastic two bedroom, two bathrooms (en-suite) apartment in Proton development. The property has a private balcony overlooking the river and the O2 dome and canary wharf. The property boasts 2 very good size double bedrooms, stunning throughout, secure cycle storage, Large private balcony with river views, fitted kitchen & 2 bathrooms, communal gardens, fully equipped gym and 24 hour concierge.","title":"2 bedroom flat","available":"Ask agent","price":"£2,448 pcm","agency":"Jack Barclay Estates, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141956069#/?channel=RES_LET","address":"Basin Approach, London, E14","description":"Property Reference: 1894331.\n\n2 Bed Flat, Basin Approach, E14\n\nWe are proud to offer this delightful 2 bedroom, 2 bathroom flat in a great location.\n\nAvailable to move in from 03 December 2023. Property is offered furnished.\n\nViewing highly recommended. Contact OpenRent today for more details or to arrange a viewing! \n\nSummary\n\nRent £2,550.00 per month (£588.46 per week)\nDeposit / Bond is £2,550.00\n\nMinimum tenancy is 18 months\nMaximum number of tenants is 4\n\nStudents welcome to enquire\nNo Pets, sorry\nNo Smokers\nFamily Friendly\n\nBills not included\nEPC Rating: Currently Being Obtained\n\n If calling, please quote reference: 1894331 \n\nFees:\nYou will not be charged any admin fees.\n\n\n ** Contact today to book a viewing and have the landlord show you round! ** \nRequest Details form responded to 24/7, with phone bookings available 9am-9pm, 7 days a week.","title":"2 bedroom flat","available":"03/12/2023","price":"£2,550 pcm","agency":"OpenRent, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141086468#/?channel=RES_LET","address":"DUNBAR WHARF,  NARROW STREET E14 ","description":"LUXURY RIVERSIDE LIVING...\r\nAlphabet City is delighted to offer this beautifully presented, spacious 2 bed, 2 bathroom apartment with superb river views in the ever popular Dunbar Wharf. The apartment features a glass balcony to enhance the view, contemporary furnishing, wood flooring, concierge service and gym. Parking included, it is only minutes to either Westferry or Limehouse DLR, this apartment is perfectly situated for Canary Wharf  or the City, and local restaurants, bars and cinema. Don't miss out call now to view!\r\n\nAVAILABLE: 03.11.23\r\n\nVIRTUAL VIEWING AVAILABLE \r\n\nACCOMMODATION\r\nReception with views of Thames, fully fitted kitchen, two double bedrooms, family bathroom, en-suite shower room, balcony, concierge, parking.\r\n\nTRANSPORT\r\nLimehouse DLR & Main line (0.2 miles) | Westferry DLR  (0.5 miles)\r\n\nOTHER INFO\r\nEPC Band - C | Total Floor Area - 87m²  \r\nCouncil Tax - Band G - £2,635.04 to Mar '24 | Local Authority -  \n\nVIEWING\r\nAll viewing strictly by appointment with Alphabet City  ,","title":"2 bedroom apartment","available":"17/11/2023","price":"£2,665 pcm","agency":"Alphabet City, London Sales Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/55k/54223/141086468/54223_6780252_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141946076#/?channel=RES_LET","address":"Ocean Wharf, 60 Westferry Road, Isle of Dogs, E14","description":"A fantastic two double bedroom apartment located in Ocean Wharf which has direct views of the River from its private balcony. The apartment has been furnished to a fantastic standard and benefits from entrance hall with ample storage, large, open plan reception room with fully integrated kitchen and access to the balcony, master bedroom with en-suite bathroom (includes bath tub and walk-in shower cubicle), second double bedroom with built-in wardrobes and main family bathroom.\n\nOcean Wharf is a gated development and is located within a short walk to Canary Wharf Jubilee line station. Additional benefits include a day time porter and one allocated parking space.","title":"2 bedroom apartment","available":"05/01/2024","price":"£2,500 pcm","agency":"Franklyn James, Westferry Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141944294#/?channel=RES_LET","address":"Narrow Street, London, E14","description":"Knight Frank are pleased to offer this third floor apartment located within the Dunbar Wharf development.  The apartment is set over approximately 90.21 sq m (approximately 971 sq ft) and offers reception room, private balcony, separate fully fitted kitchen, principal bedroom with en suite and fitted wardrobes, second bedroom, guest bathroom and one allocated parking space.  The apartment is offered on a furnished basis.  EPC C\n\n\nThe development offers concierge and residents gym.\nDunbar Wharf is located towards the western end of Narrow Street within close proximity of Canary Wharf (0.2 miles). Transport links can be found at Westferry Road DLR (0.1 miles). All times and distances are approximate.","title":"2 bedroom flat","available":"Ask agent","price":"£2,665 pcm","agency":"Knight Frank - Lettings, Canary  Wharf Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/66k/65872/141944294/65872_CWQ012359621_FLP_00_0001.png"},{"link":"https://www.rightmove.co.uk/properties/141943793#/?channel=RES_LET","address":"Dunbar Wharf, Narrow Street, Limehouse E14","description":"This modern furnished two bedroom, two bathroom riverside apartment with secure parking space and a balcony affording impressive views of the Thames is set in this sought-after wharf development in Limehouse E14, a short distance away from Westferry DLR station. \n\nThe accommodation is spacious and bright with an open plan kitchen/living room, a master bedroom with an ensuite bathroom, a further double bedroom and a family bathroom. \n\nWestferry station, only 0.2 miles away, runs frequent trains to Canary Wharf and Bank. The apartment is within easy reach of the amenities in Limehouse including the charming Ropemakers Field, parks and Limehouse Marina. \n\nDeposit: Equivalent to 5 weeks’ rent\nCouncil: Tower Hamlets - Tax Band G\nClient Money Protection (CMP) provided by: UKALA\nThe Property Ombudsman Scheme, Membership No: T02100","title":"2 bedroom apartment","available":"Now","price":"£2,665 pcm","agency":"Chase Evans, Canary Wharf Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/29k/28238/141943793/28238_P67406_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141268145#/?channel=RES_LET","address":"Gainsborough House, E14","description":"An immaculate two bedroom, two bathroom property, close to Canary Wharf.\n\nThis apartment is found within the gated development of Canary Central, which offers concierge services and also benefits from a gym, swimming pool and sauna for residents.\n\nThere is plenty of natural light throughout the property as there are floor to ceiling windows, with lovely wooden floors.\n\nThe closest DLR station is South Quay, which offers good connections to Bank, Canary Wharf and Stratford. Or a short walk across the dock will see you in Canary Wharf without the need for public transport.\n\nThis property is available with a Deposit Free option which means that instead of paying a traditional five weeks security deposit, you pay a fee of one weeks rent + VAT (subject to a minimum of £120 + VAT) to become a member of a deposit free renting scheme which significantly reduces the up-front costs. This fee is non-refundable and is not a deposit so cannot be used towards covering the cost of any future damage.","title":"2 bedroom flat","available":"Now","price":"£2,448 pcm","agency":"Felicity J Lord, Canary Wharf Lettings Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141920195#/?channel=RES_LET","address":"Narrow Street, Limehouse, Westferry Road, London, E14 8BP","description":"Jack Barclay Estates are pleased to offer this spacious 2 bedroom apartment located in this sought after location on Narrow Street, Limehouse. This property benefits from having double glazing, one double bedroom, open plan kitchen lounge, tiled bathroom and shower, laminated flooring, neutral decor and comes furnished or unfurnished.","title":"2 bedroom flat","available":"Ask agent","price":"£2,383 pcm","agency":"Jack Barclay Estates, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/140722145#/?channel=RES_LET","address":"New Providence Wharf, E14","description":"Alliance London are please to offer a fantastic two bedroom apartment that is situated in a modern block with stunning balcony views. Spacious, warm and bright, you will find everything you need. There are 2 bathrooms, 2 double bedrooms, a fully fitted kitchen, and a living room with dining table. There is a balcony with river views and the development has a gym onsite with a swimming pool 7 minute walk from the Blackwall DLR station, or East India DLR station. The DLR provides a direct service to Bank station, which then provides Central and Northern line service to the rest of London. You are also a 15 minute walk from the Canary Wharf tube station, which provides very fast tube service into the centre of London via the Jubilee line.","title":"2 bedroom flat","available":"09/12/2023","price":"£2,650 pcm","agency":"Alliance London, London Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/78k/77148/140722145/77148_190035_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141915437#/?channel=RES_LET","address":"ABILITY PLACE 37 MILLHARBOUR E14 9DF ","description":"Extremely spacious two double bedroom two bathroom furnished luxury apartment with parking located on the 15th floor of the highly sought after dock side development Ability Place offering spectacular views located moments from the centre of Canary Wharf.\n\nThis impressive apartment offers living accommodation of 63 sq meters comprises of a spacious bright reception with floor to ceiling windows, private balcony offering wonderful views of Millharbour Dock, fully equipped kitchen with granite work surfaces, two large double bedrooms, the master bedroom benefits from a luxurious marble en suite and balcony, and a further guest bathroom.\n\nResidents benefit from excellent facilities that include 24 hour concierge, large fully equipped gymnasium, Jacuzzi, steam room, sauna.\nbike storage.\n\nAbility Place is ideally located only a few moments to South Quay (D.L.R) and a few minutes' walk to the centre of Canary Wharf (Jubilee Line & Queen Elizabeth Line) with its array of shops and restaurants, Waitrose, and M&S Food Hall.\n\nEnjoy the great outdoors close by in the open fields of Mudchute park and farm along with water sports on the dock that include sailing, canoeing, windsurfing and paddle boarding with The Docklands Sailing and Water sports Club.\n\nE.P.C. Rating C\n\nCouncil tax band G\n\n5 weeks deposit required .\n\nDisclaimer: Campbell Residential endeavour to advertise accurate representations of properties in descriptions, virtual tours and floor plans, however, they are intended as a guide only and interested parties must satisfy themselves by undertaking a personal inspection.","title":"2 bedroom apartment","available":"15/12/2023","price":"£2,600 pcm","agency":"Campbell Residential, Docklands Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141913850#/?channel=RES_LET","address":"Millennium Drive, Isle Of Dogs, London","description":"Stylishly decorated, this fabulous two bedroom first floor apartment within in this popular and secure Millennium Drive development boasts secure gated parking, bright and modern accommodation. The property comprises spacious reception/dining room, sizeable fitted kitchen with appliances, two double bedrooms, the master of which has fitted storage and an en suite bathroom, separate bathroom, a Juliet balcony that looks out towards the development and allocated secure gated parking. Millennium drive is fashionably located next to the Greenwich foot tunnel and within walking distance of the many elite shops, bars and restaurants of Canary Wharf and West India Quay. Local transport links include Canary Wharf Station.\r\n\nEPC Grade D, Deposit is £2134.65 Council Tax Band E\r\n\n\n\nAll data and information set forth on this website regarding real property, for sale, purchase, rental and/or financing, are from sources regarded as reliable. No warranties are made as to the accuracy of any descriptions and/or other details and such information is subject to errors, omissions, changes of price, tenancies, commissions, prior sales, leases or financing, or withdrawal without notice. Square footages are approximate and may be verified by consulting a professional architect or engineer.","title":"2 bedroom flat","available":"12/12/2023","price":"£1,846 pcm","agency":"Global House Estates, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141272345#/?channel=RES_LET","address":"Schooner Close, Canary Wharf","description":"A two bedroom two bathroom split level apartment with private garden. The apartment has wood flooring, built in storage, a private garage and parking.\n\nSchooner Close is located less than half a mile from Mudchute DLR station providing easy access to Canary Wharf and the City.","title":"2 bedroom flat","available":"Ask agent","price":"£2,297 pcm","agency":"Dexters, Canary Wharf Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/83k/82537/141272345/82537_32685883_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141582650#/?channel=RES_LET","address":"Schooner Close, Canary Wharf","description":"A two bedroom two bathroom split level apartment with private garden. The apartment has wood flooring, built in storage, a private garage and parking.\n\nSchooner Close is located less than half a mile from Mudchute DLR station providing easy access to Canary Wharf and the City.","title":"2 bedroom flat","available":"Ask agent","price":"£2,297 pcm","agency":"Waterview, Waterview Shad Thames Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/199k/198539/141582650/198539_32702574_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141908759#/?channel=RES_LET","address":"Cassilis Road, Canary Wharf","description":"A large two bedroom apartment on sixth floor of this sought after development. This bright apartment has two bathrooms, a private balcony and a residents gym and pool and concierge.\n\nGainsborough House is in the heart of South Quay, moments from Millharbour Dock and a selection of shops, bars and restaurants in Canary Wharf.","title":"2 bedroom flat","available":"Ask agent","price":"£2,396 pcm","agency":"Dexters, Canary Wharf Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/83k/82537/141908759/82537_32719508_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141902999#/?channel=RES_LET","address":"Westferry Road, Canary Wharf","description":"A large two bedroom apartment on the fourth floor of this sought after development. This spacious apartment has floor to ceiling windows, two bathrooms and river views.\n\nMillennium Harbour is a riverside development moments from the bars and restaurants of Westferry Circus, including the popular  Royal China.","title":"2 bedroom flat","available":"Ask agent","price":"£2,197 pcm","agency":"Dexters, Canary Wharf Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141900986#/?channel=RES_LET","address":"Province Square, Canary Wharf","description":"A modern two bedroom two bathroom apartment on the 12th floor of this sought after development. With an open plan reception room, tiled flooring, private balcony and concierge.\n\nStreamlight Tower is a modern development moments from the Poplar Dock Marina and the shops, bars, restaurants of Canary Wharf.","title":"2 bedroom flat","available":"Ask agent","price":"£2,249 pcm","agency":"Dexters, Canary Wharf Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141887444#/?channel=RES_LET","address":"Tasman Court, 244 Westferry Road, E14","description":"Offering spacious two bedroom and two bathroom property boasting a modern kitchen alongside an open-plan living space with a private balcony which provides an abundance of natural light to the living room. \n\nTasman Court is located close to the local shops and amenities on Westferry Road alongside being moments away from Canary Wharf, Mudchute Park and the River Thames.","title":"2 bedroom apartment","available":"30/11/2023","price":"£2,300 pcm","agency":"Franklyn James, Westferry Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/67k/66685/141887444/66685_32718399_FLP_00_0000.gif"},{"link":"https://www.rightmove.co.uk/properties/141867176#/?channel=RES_LET","address":"Gainsborough House, Cassilis Road, Canary Wharf, London, E14","description":"Set within the ever-popular Canary Central development, this generously sized apartment comprises of an open plan kitchen and living area where you can enjoy some peace and quiet after the hustle and bustle of the Canary Wharf working day. \n\nCome home to find your parcels safely stored by the 24hr concierge, and for further relaxation, you can head to the newly-refurbished leisure facilities, which are strictly for resident's only, and include a full gymnasium, swimming pool and even a jacuzzi and sauna! \n\nThe kitchen is perfectly designed to maximise your work and storage space, and the built in appliances make cooking a breeze; whether it's your take on Jamie Oliver's latest recipe, or a simple ready meal for your built-in microwave, you will have everything to hand. \n\nLocated just a 10-minute walk from Canary Wharf, and within a 3-minute walk of South Quay DLR station, this development has remained popular with professionals over many years due to its convenient commute to and from London's busiest business areas. Secure underground parking also included!","title":"2 bedroom apartment","available":"Now","price":"£2,650 pcm","agency":"Life Residential, Canary Wharf Office - Lettings Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/53k/52518/141867176/52518_CWL230099_L_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141859418#/?channel=RES_LET","address":"Indescon Square, Canary Wharf, London, E14","description":"When you get a spare moment, you will want to come and see this stunning Two Bedroom / Two Bathroom apartment.\n\nThe apartment sits in the Indescon Square development where you can sit back and enjoy the view from one of your two balconies. Enjoy your own paradise of comfort and modernity in the open plan kitchen and living room, where cooking and watching your favourite TV series goes hand in hand. \nNo more London box bedrooms for you, as the spacious bedroom allows you to wake up in style with floor to ceiling windows. Sometimes living in the city can be noisy, but living here offers a moment of rare tranquillity amongst the popular business districts, with no busy roads outside your door.\n\nThe local area provides you with close by shops as well as all the amenities Canary Wharf has to offer. The 24hr concierge are always on hand to help you collect parcels or even just to make you feel safe whilst walking around the development. Situated only 0.5 miles from Canary Wharf Tube station and 0.4 miles from South Quay DLR, commuting to work, whether you work in Canary Wharf itself or the City, is easy. \n\nDoes this sound like the perfect place for you? Give us a call on   to arrange a viewing while it is still fresh on the market.","title":"2 bedroom apartment","available":"16/11/2023","price":"£2,400 pcm","agency":"Life Residential, Canary Wharf Office - Lettings Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/53k/52518/141859418/52518_CWL230094_L_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141304133#/?channel=RES_LET","address":"Duckman Tower, 3 Lincoln Plaza, Canary Wharf, London, E14","description":"Fancy a luxurious and modern way of living? Well prepare yourself because we have something majestic for you!\n\nThis two bedroom apartment just minutes away from Canary Wharf will exceed your expectations. Can you imagine stunning view from these floor to ceiling windows? If you want even bigger effect then pop to amazing and relaxing winter garden on 22nd floor to enjoy stunning views of the Docks. Hard to believe it right? Well better come and see it yourself then.\n\nWe know how hard you work so we want to make sure that when you get back home you don't have to worry about anything and just enjoy your time at home. Furnished to an exceptionally high standard, you'll be the envy of your friends as you enjoy luxury London LiFE at its best. Preparing your dinner will become the easiest and enjoyable thing to do! Thanks to this modern fully-equipped kitchen you don't even have to worry about washing your dishes because quick and efficient dishwasher will do this dirty job for you. \n\nYou are right next to hustle and bustle of Canary Wharf, with easy access to over 240 shops, restaurants, bars, galleries and all the other amenities the area has to offer. Canary Wharf exudes a lifestyle like no other. \n\nThe location is ideal, being situated minutes walk to South Quay DLR station commuting into Stratford or the City is a breeze! You can even enjoy the perks of the 24-hour jubilee line by walking to Canary Wharf station. Commuting around London has never been easier. Sound like the perfect place for you?","title":"2 bedroom apartment","available":"13/12/2023","price":"£2,750 pcm","agency":"Life Residential, Canary Wharf Office - Lettings Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/53k/52518/141304133/52518_CWL150024_L_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141382460#/?channel=RES_LET","address":"Ability Place, London, E14","description":"Property Reference: 1877571.\n\nExtremely spacious two double bedroom two bathroom luxury apartment with parking located on the 12th floor of the highly sought after dock side development Ability Place offering spectacular views located moments from the centre of Canary Wharf.\n\nThis impressive apartment offers living accommodation of 920 sqft comprises of a spacious bright reception with floor to ceiling windows, private balcony offering wonderful views of Canary Wharf and Millharbour Dock, fully equipped kitchen with granite work surfaces, two large double bedrooms, the master bedroom benefits from a luxurious marble en suite and balcony, and a further guest bathroom.\n\nResidents benefit from excellent facilities that include 24 hour concierge, large fully equipped gymnasium, Jacuzzi, steam room and sauna.\n\nAbility Place is ideally located only a few moments to South Quay (D.L.R) and a few minutes' walk to the centre of Canary Wharf (Jubilee Line) with its array of shops and restaurants, Waitrose, and M&S Food Hall.\n\nEnjoy the great outdoors close by in the open fields of Mudchute park and farm along with watersports on the dock that include sailing, canoeing, windsurfing and paddle boarding with The Docklands Sailing and Watersports Club.\n\nE.P.C. Rating C\n\nSummary & Exclusions:\n- Rent Amount: £2,700.00 per month (£623.08 per week)\n- Deposit / Bond: £3,115.38\n- 2 Bedrooms\n- 2 Bathrooms\n- Property comes furnished\n- Available to move in from 09 November, 2023\n- Minimum tenancy term is 12 months\n- Maximum number of tenants is 4\n- Students welcome to enquire\n- No Pets, sorry\n- No Smokers\n- Family Friendly\n- Bills Included\n- Property has parking\n- No Garden Access\n- EPC Rating: C\n\n If calling, please quote reference: 1877571 \n\nFees:\nYou will not be charged any admin fees.\n\n\n ** Contact today to book a viewing and have the landlord show you round! ** \nRequest Details form responded to 24/7, with phone bookings available 9am-9pm, 7 days a week.","title":"2 bedroom flat","available":"Now","price":"£2,700 pcm","agency":"OpenRent, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141844805#/?channel=RES_LET","address":"Indescon Square, Canary Wharf, London, E14","description":"When you get a spare moment you'll want to come and see this 2 bedroom, 2 bathroom apartment. The apartment sits on a high floor of the Indescon Square development where you can sit back and relax on your own private balcony after a long day at the office. \n\nEnjoy your own paradise of comfort and modernity in the open plan kitchen and living room, where cooking and watching your favourite TV series goes hand in hand. No more London box bedrooms for you, as the spacious bedroom allows you to wake up in style with floor to ceiling windows. \n\nSometimes living in the city can be pretty noisy, but living here offers a moment of rare tranquillity amongst the popular business districts, with no busy roads outside your door. The local area provides you with close by shops as well as all the amenities Canary Wharf has to offer. The 24hr concierge are always on hand to help you collect parcels or even just to make you feel safe whilst walking around the development. Situated only 0.5 miles from Canary Wharf Tube station and 0.4 miles from South Quay DLR, commuting to work, whether you work in Canary Wharf itself or the City, is easy.","title":"2 bedroom apartment","available":"20/12/2023","price":"£2,500 pcm","agency":"Life Residential, Canary Wharf Office - Lettings Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/53k/52518/141844805/52518_CWL100311_L_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141820265#/?channel=RES_LET","address":"Millharbour, London, E14","description":"This spacious and beautifully furnished two-bedroom, two-bathroom flat offers the perfect blend of modern living and convenience. \n\nAs you step into this stylish apartment, you'll be greeted by an open and bright living space. The living room features large windows that fill the room with natural light, creating a warm and inviting atmosphere. It's the ideal space for relaxation and entertaining.\n\nThe well-equipped kitchen boasts modern appliances, ample storage, and a sleek design that will inspire your inner chef. Whether you're preparing a quick breakfast or hosting a dinner party, this kitchen has you covered.\n\nThe two bedrooms are generously sized and come with comfortable furnishings, making it easy to unwind and get a good night's rest. The master bedroom features an en-suite bathroom for added privacy and convenience.\n\nBoth bathrooms are elegantly designed and equipped with all the amenities you need for a refreshing start to your day or a soothing end in the evening.\n\nThis flat also offers the convenience of in-unit laundry facilities and ample storage throughout. Additionally, residents have access to on-site amenities, such as a fitness center and a communal garden.\n\nLocated in the vibrant Millharbour E14 area, you'll be within easy reach of Canary Wharf, local restaurants, shopping, and excellent transportation links. Whether you're a young professional or a family, this flat offers the perfect combination of comfort and convenience in one of London's most sought-after neighborhoods.\n\nFor more information about our fees please visit our web-site’s ‘Tenant Fees’ page located under the Rent tab.\n\n CBRE Limited on its behalf and for the Vendors or Lessors of this property whose Agents they are, give notice that:\n\n1. These particulars are set out as a general outline only for guidance to intending Purchasers or Lessees, and do not constitute any part of an offer or contract.  \n2.Whilst CBRE Limited uses reasonable endeavours to ensure that the information in these particulars is materially correct, some of the information is derived from third parties and has not been verified by us. Any intending Purchasers, Lessees or Third Parties should not rely on this information as a statement or representation of fact, but must satisfy themselves by their own inspection, searches, enquiries, surveys or otherwise as to the accuracy and completeness.\n3. To the maximum extent permitted by law CBRE Limited accepts no liability or responsibility for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss of profits resulting from direct or indirect actions based upon the content of these particulars. No person in the employment of CBRE Limited has any authority to make any representation or warranty whatsoever in relation to this property.\n4. Unless otherwise stated, all purchase prices and rents are correct at the date of publication and, unless otherwise stated,  are quoted exclusive of VAT.  Lease details and service ground rent (where applicable) are given as a guide only and should be checked and confirmed by your solicitor prior to exchange of contracts.","title":"2 bedroom apartment","available":"Ask agent","price":"£2,492 pcm","agency":"CBRE Residential, Docklands Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/37k/36789/141820265/36789_CAR150122_L_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141869639#/?channel=RES_LET","address":"Limeview Apartments, 2 John Nash Mews, Limehouse, Canary Wharf, London, E14 7GQ","description":"Jack Barclay Estates are offering a 2 double bedroom apartment set within this stylish gated development. Situated on the third floor, the fully furnished property comprises of an open-plan lounge/kitchen with fully integrated appliances, a modern bathroom and a spacious 2 double bedrooms. The property benefits from having a private balcony providing an abundance of natural light and lovely views of the Limehouse basin.\n\nA superb location close to vibrant bars and restaurants. The property has easy access to Narrow Street which provides a lovely river walk along the Thames. It is also within walking distance to Limehouse DLR, offering access into the financial hub of Canary Wharf, City and West End.","title":"2 bedroom apartment","available":"Ask agent","price":"£2,405 pcm","agency":"Jack Barclay Estates, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141833450#/?channel=RES_LET","address":"Marina Heights, Basin Approach, Limehouse, Westferry, Canary Wharf, London, E14 7JA","description":"Jack Barclay Estates is proud to offer an extensive one bedroom apartment that includes a neat kitchen, spacious reception, polished bathroom and balcony that involves a appealing view of The Famous River Thames.\n\nThis superb apartment on Basin Approach is easily located as it is walking distance to Limehouse DLR Station, in addition the A12 & A13 are found on Commercial Road which is less than a minute away.","title":"2 bedroom flat","available":"Ask agent","price":"£2,405 pcm","agency":"Jack Barclay Estates, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/140667779#/?channel=RES_LET","address":"Victory Place, E14","description":"Available mid November is this immaculately presented two double bedroom second floor apartment boasting Limehouse Basin water views from a large private balcony.\n\nThe property is neutrally decorated throughout and benefits from having a spacious reception with laminate flooring, modern fitted kitchen complete with appliances, recently refurbished bathroom suite and en-suite shower room to the master bedroom.\n\nResidents of this private gated development enjoy a close community vibe, a residents only Gymnasium as well as a daytime porterage service.\n\nVictory Place is located in the heart of Limehouse and sits on the edge of the Marina and is well positioned for both Canary Wharf and Limehouse DLR stations. \n\nThe property is offered fully furnished* and has a private parking space. A prompt internal viewing is recommended.","title":"2 bedroom apartment","available":"Ask agent","price":"£2,395 pcm","agency":"Hurford Salvi Carr, Docklands Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/15k/14546/140667779/14546_DLL160155_L_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/86528436#/?channel=RES_LET","address":"Vantage Mews, London, E14","description":"Property Reference: 1861005.\n\nThis fantastic two bedroom, two bathroom property is new to the market. At nearly 800 square feet accompanied with an en suite bathroom and large balcony. There is dual access to the balcony from the Living Area and from the Master Bedroom. With an open plan Living Room and kitchen, viewings are advisable. There is also a fantastic amount of storage in the property. \n\nThe River Thames is on the doorstep, Canary Wharf Station and Isle of Dogs Station is also a short walk from the property for ease of travel around London.\n\nThe property is ideal for two people who are working from home or for a small family.\n\nSummary & Exclusions:\n- Rent Amount: £2,500.00 per month (£576.92 per week)\n- Deposit / Bond: £2,884.61\n- 2 Bedrooms\n- 2 Bathrooms\n- Property comes furnished or unfurnished (tenant can decide)\n- Available to move in from 23 November, 2023\n- Minimum tenancy term is 12 months\n- Maximum number of tenants is 4\n- No Students\n- No Pets, sorry\n- No Smokers\n- Family Friendly\n- Bills not included\n- No Parking Available\n- Property has garden access\n- EPC Rating: B\n\n If calling, please quote reference: 1861005 \n\nFees:\nYou will not be charged any admin fees.\n\n\n ** Contact today to book a viewing and have the landlord show you round! ** \nRequest Details form responded to 24/7, with phone bookings available 9am-9pm, 7 days a week.","title":"2 bedroom flat","available":"23/11/2023","price":"£2,500 pcm","agency":"OpenRent, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141820265#/?channel=RES_LET","address":"Millharbour, London, E14","description":"This spacious and beautifully furnished two-bedroom, two-bathroom flat offers the perfect blend of modern living and convenience. \n\nAs you step into this stylish apartment, you'll be greeted by an open and bright living space. The living room features large windows that fill the room with natural light, creating a warm and inviting atmosphere. It's the ideal space for relaxation and entertaining.\n\nThe well-equipped kitchen boasts modern appliances, ample storage, and a sleek design that will inspire your inner chef. Whether you're preparing a quick breakfast or hosting a dinner party, this kitchen has you covered.\n\nThe two bedrooms are generously sized and come with comfortable furnishings, making it easy to unwind and get a good night's rest. The master bedroom features an en-suite bathroom for added privacy and convenience.\n\nBoth bathrooms are elegantly designed and equipped with all the amenities you need for a refreshing start to your day or a soothing end in the evening.\n\nThis flat also offers the convenience of in-unit laundry facilities and ample storage throughout. Additionally, residents have access to on-site amenities, such as a fitness center and a communal garden.\n\nLocated in the vibrant Millharbour E14 area, you'll be within easy reach of Canary Wharf, local restaurants, shopping, and excellent transportation links. Whether you're a young professional or a family, this flat offers the perfect combination of comfort and convenience in one of London's most sought-after neighborhoods.\n\nFor more information about our fees please visit our web-site’s ‘Tenant Fees’ page located under the Rent tab.\n\n CBRE Limited on its behalf and for the Vendors or Lessors of this property whose Agents they are, give notice that:\n\n1. These particulars are set out as a general outline only for guidance to intending Purchasers or Lessees, and do not constitute any part of an offer or contract.  \n2.Whilst CBRE Limited uses reasonable endeavours to ensure that the information in these particulars is materially correct, some of the information is derived from third parties and has not been verified by us. Any intending Purchasers, Lessees or Third Parties should not rely on this information as a statement or representation of fact, but must satisfy themselves by their own inspection, searches, enquiries, surveys or otherwise as to the accuracy and completeness.\n3. To the maximum extent permitted by law CBRE Limited accepts no liability or responsibility for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss of profits resulting from direct or indirect actions based upon the content of these particulars. No person in the employment of CBRE Limited has any authority to make any representation or warranty whatsoever in relation to this property.\n4. Unless otherwise stated, all purchase prices and rents are correct at the date of publication and, unless otherwise stated,  are quoted exclusive of VAT.  Lease details and service ground rent (where applicable) are given as a guide only and should be checked and confirmed by your solicitor prior to exchange of contracts.","title":"2 bedroom apartment","available":"Ask agent","price":"£2,492 pcm","agency":"CBRE Residential, Docklands Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/37k/36789/141820265/36789_CAR150122_L_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/139825616#/?channel=RES_LET","address":"Meridian Place, Canary Wharf","description":"A two bedroom property on the second floor of Meridian Place. This property has a spacious living space, separate kitchen, wood floors, ample storage, two double bedrooms, two bathrooms and a private balcony with dock views. Underground parking also available.\n\nLocated just around the corner from the footbridge that takes you directly into Canary Wharf Station and the local shopping centre for all shops, bars and restaurants.","title":"2 bedroom flat","available":"Ask agent","price":"£2,773 pcm","agency":"Dexters, Canary Wharf Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141582632#/?channel=RES_LET","address":"Meridian Place, Canary Wharf","description":"A two bedroom property on the second floor of Meridian Place. This property has a spacious living space, separate kitchen, wood floors, ample storage, two double bedrooms, two bathrooms and a private balcony with dock views. Underground parking also available.\n\nLocated just around the corner from the footbridge that takes you directly into Canary Wharf Station and the local shopping centre for all shops, bars and restaurants.","title":"2 bedroom flat","available":"Ask agent","price":"£2,773 pcm","agency":"Waterview, Waterview Shad Thames Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141793472#/?channel=RES_LET","address":"Manilla Street, Canary Wharf","description":"An exceptionally large two bedroom apartment on the second floor of this sought after development. This bright apartment has an open plan reception room, wooden flooring and a private balcony.\n\nRegatta Point is a residential development moments from the bars and restaurants of Westferry Circus, including the popular Royal China.","title":"2 bedroom flat","available":"Ask agent","price":"£2,401 pcm","agency":"Waterview, Waterview Shad Thames Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141786962#/?channel=RES_LET","address":"Manchester Road, Canary Wharf","description":"A well-proportioned two bedroom apartment set within a riverside development in Canary Wharf. Recently refurbished with new wooden flooring and redecorated throughout. The property is offered furnished with parking available by negotiation.\n\nPierhead Lock is a gated complex near to South Quay DLR Station and within easy reach of the shops, bars, restaurants of Canary Wharf, which also has access to the Jubilee Line and Cross Rail services.","title":"2 bedroom flat","available":"Ask agent","price":"£2,496 pcm","agency":"Waterview, Waterview Shad Thames Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/199k/198539/141786962/198539_32712458_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141399986#/?channel=RES_LET","address":"Shackleton COurt, Maritime Quay, London, E14","description":"Abby Properties proudly presents this recently decorated and renovated two double bedroom third-floor apartment, situated within a tranquil gated riverside development. The apartment boasts an exceptionally spacious master bedroom with built-in wardrobes and a brand-new ensuite shower room. The second bedroom is generously sized, featuring built-in wardrobes and floor-to-ceiling doors that lead to a balcony. The bathroom suite includes a shower over the bath for added convenience. The apartment offers a large lounge area with floor-to-ceiling doors that open to a balcony overlooking the majestic Thames River. The fully fitted kitchen is equipped with integrated appliances and a gas hob. Throughout the apartment, newly laid wooden floors enhance the ambiance, complemented by efficient gas central heating. For added convenience, secure parking is provided. The location is ideal, being just a minute away from river services and in close proximity to Mudchute and Island Gardens DLR Stations. This desirable property is available for occupancy immediately.\r\n\nAwaiting internal Photos\r\n\nCouncil Tax band: E","title":"2 bedroom apartment","available":"Ask agent","price":"£2,300 pcm","agency":"Abby Properties LTD, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141437144#/?channel=RES_LET","address":"Apollo Building Isle of Dogs","description":"Close to Mudchute DLR Station, this two-bedroom property in a modern development benefits from a light and spacious living area with fantastic views over the Thames and Southern London from its large private balcony.\n\nThe kitchen is contemporary and luxurious in design, adding a touch of character with its mauve cabinets, chrome fixtures, and stylish dark tiling. With lots of storage space it is as practical as it is aesthetically attractive.\n\nBoth bedrooms, like the living and dining area, are modern, of a good size, and filled with natural light. \n\nThe two bathrooms are clean, simplistic, and easy to maintain. \n\nThe building itself is a modern, river-side development and along with a 24hr concierge, also has its own gym. \n\nThe property comes either furnished or unfurnished, and is ideally located in the heart of Isle of Dogs- only a short journey away from Canary Wharf.","title":"2 bedroom apartment","available":"Now","price":"£2,496 pcm","agency":"Rubicon Estate Agents Limited, Narrow Street Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/16k/15076/141437144/15076_2672512_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/86595018#/?channel=RES_LET","address":"Hamilton House Victory Place Limehouse","description":"This well positioned TWO DOUBLE BEDROOM home sits on the LIME HOUSE MARINA with views from all rooms – including the PRIVATE BALCONY accessible via the reception.\nThe SEPARATE KITCHEN sits adjacent to the reception, fully equipped with GAS HOB.\nThe master bedroom has BUILT IN WARDROBES on opposite walks leading into the EN SUITE. \nThe GUEST ROOM is placed in between the reception and the master still offering generous space opposite the three-piece bathroom.\nIn addition, the home also benefits from being on the FIRST FLOOR with SECURE PARKING INCLUDED, HARD FLOORING THROUGHOUT, GAS HEATING and CONCIERGE SERVICE. Limehouse DLR is within a short walk around the Marina.","title":"2 bedroom apartment","available":"Now","price":"£2,396 pcm","agency":"Rubicon Estate Agents Limited, Narrow Street Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141959174#/?channel=RES_LET","address":"Neutron Tower, 6 Blackwall Way, East India Quay, Canary Wharf, London, E14 9GW","description":"Jack Barclay Estates are delighted to offer this 2 bedroom 2 bathroom apartment, within the newly built Neutron development with views of the River Thames and the Dome. The apartment consists of 2 double bedrooms, 2 bathroom, open plan lounge with balcony and also benefits from the developments on site gym and 24 hour concierge.\n\nThe location of this development is ideal as you are minutes away form virtually any central London and Canary Wharf location, due to its proximity to East India Dock Station on the DLR, within the Canary Wharf area that includes a great array of shops, bars and restaurants within close proximity. Transport links such as Docklands Light Railway, Canary Wharf Underground station and Thames Clipper ferry are all within easy access.","title":"2 bedroom flat","available":"Ask agent","price":"£2,470 pcm","agency":"Jack Barclay Estates, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141774008#/?channel=RES_LET","address":"Baltimore Wharf, Canary Wharf, London, E14","description":"We are proud to present this impressive 2 bedroom, 2 bathroom apartment in Baltimore Wharf which is not to be missed. Comprising an open plan living space, 2 larger bedrooms, modern bathroom and private balcony, this stylish apartment makes for a perfect home. Floor to ceiling windows create an abundance of natural light whilst making the most of the tranquil views on offer.\n\nWith excellent transport links on your doorstep, including the adjacent Crossharbour DLR station and Canary Wharf, for Jubilee Line and Elizabeth Line only a short walk away, you enjoy easy access to Central London and further afield. \nBaltimore Wharf benefits from onsite leisure facilities; including 24hr concierge, gym, swimming pool, boxing ring & cardio area. Local amenities are in abundance with supermarkets, bars and restuarants all within walking distance.","title":"2 bedroom terraced house","available":"15/12/2023","price":"£2,747 pcm","agency":"JOHNS&CO, Canary Wharf Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/140909756#/?channel=RES_LET","address":"Cascades Tower, Canary Wharf, London","description":"This impressive two bedroom apartment located on the 14th floor with stunning Canary Wharf views and within a short walk from the bustling Canary Wharf, situated in the Cascades Tower development. The property benefits from an abundance of light and offers a private balcony. There is an open plan kitchen which incorporates integrated appliances and a sizeable reception room leading to a private balcony with far reaching views. The master bedroom offers a walk in wardrobe along with access to a smart en suite bathroom, whilst the second bedroom also offers built in storage.  There is one secure parking space along with a 24 hour concierge, a residents' gym and swimming pool.\r\nCascades Tower is the closest residential development on Westferry Road to Canary Wharf (0.4 miles). Transport links can be found at Canary Wharf Jubilee Line (0.4 miles) and Heron Quays DLR (0.3 miles). All times and distances are approximate.\r\n\nEPC Grade C, Deposit is £2875.00 Council Tax Band F\r\n\nAll data and information set forth on this website regarding real property, for sale, purchase, rental and/or financing, are from sources regarded as reliable. No warranties are made as to the accuracy of any descriptions and/or other details and such information is subject to errors, omissions, changes of price, tenancies, commissions, prior sales, leases or financing, or withdrawal without notice. Square footages are approximate and may be verified by consulting a professional architect or engineer.","title":"2 bedroom flat","available":"29/11/2023","price":"£2,401 pcm","agency":"Global House Estates, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141256013#/?channel=RES_LET","address":"Baltimore Wharf, Canary Wharf, London, E14","description":"A luxurious two double bedroom apartment situated in the ever-popular Baltimore Wharf. The property has an open-plan kitchen which is fully equipped to a high specification and the bathroom is fitted with Italian marble. Baltimore Wharf benefits from 24-hour security and a leisure centre with gym and 25m swimming pool. The propery is just moments away from Crossharbour DLR as well as being a short walk into central Canary Wharf. Available December and offered furnished.\n\nCouncil Tax Band G","title":"2 bedroom flat","available":"15/12/2023","price":"£2,750 pcm","agency":"Keatons, Bow Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141073556#/?channel=RES_LET","address":"Marsh Wall, London, E14","description":"Property Reference: 1775835.\n\nA modern and sleek flat based in Meridian Place close to Canary Wharf. The property is located within 2 minutes walking distance from South Quay DLR Station, 7 mins walking to Canary Wharf Jubilee Line and Elizabeth Line. It has excellent access to amenities such as supermarkets, restaurants, bars and many more within walking distance.\n\nThe property comprises the following:\n\nA huge L shaped lounge/diner overlooking South Quay waters, with views of Canary Wharf, O2 etc\n2 double bedrooms (1 with en-suite)\n1 family bathroom\nA separate fully fitted kitchen with ceramic induction hob, etc, \n\nThe property offers plenty of storage throughout.\nLovely and bright with neutral colours throughout\nModern and tastefully furnished throughout\nElectric Central heating throughout\n\nAvailable from 5 Dec 2023.\n\nNo admin fee payable\n\nPlease call for immediate viewing.\n\nSummary & Exclusions:\n- Rent Amount: £2,450.00 per month (£565.39 per week)\n- Deposit / Bond: £2,826.92\n- 2 Bedrooms\n- 2 Bathrooms\n- Property comes furnished\n- Available to move in from 05 December, 2023\n- Minimum tenancy term is 12 months\n- Maximum number of tenants is 4\n- Students welcome to enquire\n- No Pets, sorry\n- Smokers considered\n- Family Friendly\n- Bills not included\n- Property has parking\n- Property has garden access\n- EPC Rating: B\n\n If calling, please quote reference: 1775835 \n\nFees:\nYou will not be charged any admin fees.\n\n\n ** Contact today to book a viewing and have the landlord show you round! ** \nRequest Details form responded to 24/7, with phone bookings available 9am-9pm, 7 days a week.","title":"2 bedroom flat","available":"05/12/2023","price":"£2,450 pcm","agency":"OpenRent, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141723542#/?channel=RES_LET","address":"Meridian Place, Canary Wharf, London, E14","description":"We are proud to present this beautifully presented 2 bedroom, 2 bathroom apartment within the Meridian Place development. With dock facing views, private balcony, main bedroom with ensuite and a large living area, this apartment has it all. The modern kitchen is situated just off the living area. The property has wooden floors in the main areas, carpeted bedrooms and features lots of natural light throughout. \n\nThe location is unbeatable, with a picturesque waterfront promenade. South Quay DLR station is a 2-minute walk, and Canary Wharf Jubilee Line is only 5 minutes away. The city is a quick 12-minute DLR ride, and Oxford Street is just 25 minutes away. Surrounding the property, you'll find an array of bars, restaurants, and amenities to keep you entertained.","title":"2 bedroom apartment","available":"08/12/2023","price":"£2,448 pcm","agency":"JOHNS&CO, Canary Wharf Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141723512#/?channel=RES_LET","address":"Manilla Street, Canary Wharf","description":"An exceptionally large two bedroom apartment on the second floor of this sought after development. This bright apartment has an open plan reception room, wooden flooring and a private balcony.\n\nRegatta Point is a residential development moments from the bars and restaurants of Westferry Circus, including the popular Royal China.","title":"2 bedroom flat","available":"Ask agent","price":"£2,401 pcm","agency":"Dexters, Canary Wharf Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141720560#/?channel=RES_LET","address":"Quayside House, Westferry Road, London","description":"We are delighted to present this stunning two bed apartment to rent, located within the fantastic Canary Wharf. This immaculate property comprises a bright and welcoming reception area, leading onto a fantastic balcony overlooking the Thames river, Canary Wharf, as well as the residential courtyard. A fully fitted kitchen, featuring bespoke countertops and a modern design enhances the home, also accompanied by a spacious master bedroom with a tiled en suite shower room, as well as a second bedroom and separate shower room.\n\nThis luxury apartment has undergone a recent partial refurbishment and redecoration, offering an outstanding style of living. The property further features large dual aspect windows within, allowing floods of natural light into the home and creating a bright living space for its residents. The property not only offers a number of remarkable features, but also offers residents access to exclusive facilities including access to a swimming pool, gym, tennis court, and more. The property also benefits from parking availability, making this a home perfect for all prospective tenants.","title":"2 bedroom apartment","available":"Now","price":"£2,400 pcm","agency":"Douglas Pryce, Canary Wharf Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/228k/227717/141720560/227717_32708777_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/86671773#/?channel=RES_LET","address":"Manilla Street, London, E14","description":"Presenting a larger than average apartment, located in a popular block a short walk from Canary Wharf financial district.\n\nComprising of two large double bedrooms, family bathroom, kitchen and generously sized living space. The property is offered furnished and available to move in immediately. \n\nPlease call Stirling Ackroyd directly to arrange an appointment.","title":"2 bedroom apartment","available":"Now","price":"£2,400 pcm","agency":"Stirling Ackroyd Lettings, Canary Wharf Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/86666859#/?channel=RES_LET","address":"Fairmont Avenue, New Providence Wharf, London, E14","description":"Overlooking the River Thames and tranquil communal watergardens, this large two bedroom apartment on the 8th floor of New Providence Wharf has the added bonus coming beautifully furnished. The property comprising a kitchen and living room, two double bedrooms, an ensuite and main bathroom. Floor to ceiling windows and a private balcony from the living room with an abundance of natural light throughout. Finished to a superb standard, the property is not to be missed and will come furnished.\n\nResidents here will also benefit from exceptional leisure facilities including 24-hour concierge, gym + spa as well as a swimming pool. You will find an abundance of amenities on-site and within the local area. Parking is available with this property.","title":"2 bedroom apartment","available":"05/12/2023","price":"£2,799 pcm","agency":"JOHNS&CO, New Providence Wharf Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/86665143#/?channel=RES_LET","address":"Limeharbour, London, E14 9LU","description":"Well located near to the centre of Canary Wharf, this stylish two bedroomed furnished flat, offering modern lifestyle with a east balcony, 24hrs concierge service and a secure setting on the seventh floor of a popular development. The property comprises sizeable reception room fully refurbished kitchen with smart fitted units with integrated appliances, master bedroom with en-suite shower room, second double bedroom and a chic three piece bathroom suite.Location: City Tower lies moments from Mudchute Park and the Millwall Docks, while a cosmopolitan range of shops and restaurants can be found at the nearby Canary Wharf complex. Crossharbour Station (DLR) is close by and Canary Wharf Underground Station provides the Jubilee lineAvailable: 30th DEC 2023\nTerm: Long-term\nFurnishings: Furnished\nLocal Authority: Tower Hamlets\nCouncil Tax Band: E\nCouncil Tax: £1,932.37 2023/24\nEPC Rating: CDisclaimer: Ashley King endeavour to advertise accurate representations of properties in descriptions, virtual tours and floor plans, however, they are intended as a guide only and interested parties must satisfy themselves by undertaking a personal inspection.","title":"2 bedroom flat","available":"30/12/2023","price":"£2,750 pcm","agency":"Ashley King, Docklands Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/72k/71212/86665143/71212_L17072_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141290474#/?channel=RES_LET","address":"Turner House, Canary Central, Isle of Dogs, E14","description":"This well-designed and bright 2-bed, 2-bath apartment with a balcony is set in a quiet residential enclave a short distance away from the amenities of Canary Wharf. The open-plan living/kitchen features wood flooring and floor-to-ceiling glazing and leads to a generous balcony overlooking the communal square and gardens. The master bedroom is ensuite with a sizeable built-in wardrobe. There is a further double bedroom and a family bathroom. Turner Hosue is part of the contemporary Canary Central development a stroll from the dock and South Quay DLR station. Residents have access to concierge services and modern leisure facilities including a swimming pool, Jacuzzi, sauna and gym.\n\n\n\nDeposit: Equivalent to 5 weeks' rent\nCouncil – Tower Hamlets\nCouncil tax band - E\nClient Money Protection (CMP) provided by: UKALA\nThe Property Ombudsman Scheme, Membership No: T02100","title":"2 bedroom apartment","available":"Now","price":"£2,513 pcm","agency":"Chase Evans, Pan Peninsula Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/77k/76478/141290474/76478_P67125_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141086468#/?channel=RES_LET","address":"DUNBAR WHARF,  NARROW STREET E14 ","description":"LUXURY RIVERSIDE LIVING...\r\nAlphabet City is delighted to offer this beautifully presented, spacious 2 bed, 2 bathroom apartment with superb river views in the ever popular Dunbar Wharf. The apartment features a glass balcony to enhance the view, contemporary furnishing, wood flooring, concierge service and gym. Parking included, it is only minutes to either Westferry or Limehouse DLR, this apartment is perfectly situated for Canary Wharf  or the City, and local restaurants, bars and cinema. Don't miss out call now to view!\r\n\nAVAILABLE: 03.11.23\r\n\nVIRTUAL VIEWING AVAILABLE \r\n\nACCOMMODATION\r\nReception with views of Thames, fully fitted kitchen, two double bedrooms, family bathroom, en-suite shower room, balcony, concierge, parking.\r\n\nTRANSPORT\r\nLimehouse DLR & Main line (0.2 miles) | Westferry DLR  (0.5 miles)\r\n\nOTHER INFO\r\nEPC Band - C | Total Floor Area - 87m²  \r\nCouncil Tax - Band G - £2,635.04 to Mar '24 | Local Authority -  \n\nVIEWING\r\nAll viewing strictly by appointment with Alphabet City  ,","title":"2 bedroom apartment","available":"17/11/2023","price":"£2,665 pcm","agency":"Alphabet City, London Sales Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/55k/54223/141086468/54223_6780252_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/139939361#/?channel=RES_LET","address":"Roosevelt Tower, Manhattan Plaza, Canary Wharf E14","description":"A modern two bedroom, two bathroom apartment. Located within this luxurious development, Manhattan Plaza. The property boasts of living space, with a private balcony. This bright apartment includes an inviting living and dining area, fitted kitchen with integrated appliances, wood flooring, two spacious bedrooms, master with en-suite, stylish bathroom suite and a private balcony.\n\nResidents will also benefit from video entry phone system, concierge service, private residents’ gymnasium and access to two landscaped roof-top gardens. A number of local amenities that are near the development that include shops and restaurants.  The development is located a short distance from Blackwall DLR station providing a valuable transport link for commutes to London City Airport and other destinations located within the Capital.\n\nDeposit: Equivalent to 5 weeks’ rent\nCouncil: Tower Hamlets, Band E\nClient Money Protection (CMP) provided by: UKALA\nThe Property Ombudsman Scheme, Membership No: T02100","title":"2 bedroom apartment","available":"Now","price":"£2,708 pcm","agency":"Chase Evans, Canary Wharf Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/29k/28238/139939361/28238_P66556_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141703472#/?channel=RES_LET","address":"Poplar High Street, London, E14","description":"Enjoy relaxing in this two bedroom apartment after a hard day's work which is perfect for entertaining family and friends on a spacious terrace overlooking Canary Wharf.\r\n\nThe apartment has a west facing aspect providing sun filled rooms with winter sun and warmth all year round.\r\n\nThere is plenty of space to work from home and for those times you do need to travel you are well positioned with good transport links.\r\n\nThis home is available now and comes with free underground parking.","title":"2 bedroom penthouse","available":"Now","price":"£2,250 pcm","agency":"McQueens London, London Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/181k/180098/141703472/180098_Caraway_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141694439#/?channel=RES_LET","address":"Phoenix Heights East, London, E14","description":"Property Reference: 1867575.\n\nHOT WATER & HEATING BILLS ARE INCLUDED! This cozy and newly redecorated two-bedrooms flat is perfect for those seeking a tranquil space in the heart of the Canary Wharf.The flat is furnished with a comfortable small double bed, a King-sized bed, a spacious closet in the master bedroom and living room. Plenty of storage spaces as you might need it. The decor is modern and inviting, with soothing neutral tones and tasteful artwork. You'll have access to a shared, fully equipped kitchen where you can prepare your meals, and a stylish living area where you can unwind and socialize with other residents.Connectivity: \n\n3 mins walk to South Quay DLR station \n6 mins walk to Canary Wharf Jubilee Line station \n10 mins walk to Canary Wharf Elizabeth Line station \n\nTenants who looking for move-in ONLY!\n\nSummary & Exclusions:\n- Rent Amount: £2,450.00 per month (£565.39 per week)\n- Deposit / Bond: £2,826.92\n- 2 Bedrooms\n- 1 Bathrooms\n- Property comes furnished\n- Available to move in from 18 December, 2023\n- Minimum tenancy term is 6 months\n- Maximum number of tenants is 3\n- Students welcome to enquire\n- No Pets, sorry\n- No Smokers\n- Family Friendly\n- Bills Included\n- No Parking Available\n- No Garden Access\n- EPC Rating: D\n\n If calling, please quote reference: 1867575 \n\nFees:\nYou will not be charged any admin fees.\n\n\n ** Contact today to book a viewing and have the landlord show you round! ** \nRequest Details form responded to 24/7, with phone bookings available 9am-9pm, 7 days a week.","title":"2 bedroom flat","available":"18/12/2023","price":"£2,450 pcm","agency":"OpenRent, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/140710664#/?channel=RES_LET","address":"Basin Approach, E14","description":"Huford Salvi Carr are favoured as sole agents to market this fourth floor two double bedroom south facing apartment located in the ever popular Basin Approach development.\n\nThis well-presented accommodation spans in excess of 1000 sq ft and has a rare front line position on the marina which benefits from direct water views along with incredible views of the Canary Wharf skyline.\n\nFeatures include two double bedrooms, dressing room to master suite, family bathroom and en-suite to master, neutral decor and carpets, fitted kitchen complete with appliances and large reception which leads to a large private terrace.\n\nAvailable now with parking included. A prompt internal viewing is highly recommended.","title":"2 bedroom apartment","available":"Ask agent","price":"£2,491 pcm","agency":"Hurford Salvi Carr, Docklands Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/15k/14546/140710664/14546_DLL230030_L_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141684809#/?channel=RES_LET","address":"Ocean Wharf, London, E14","description":"Property Reference: 1885891.\n\nThis contemporary fifth floor two bedroom apartment is set within a sought-after riverside development close to Canary Wharf and boasts luxury interiors with spectacular river views from a private balcony.\tKey features\tNewly refurbished, new flooring throughout, new en-suite bathroom, new gas central heating system, new LED downlights in all rooms, hyperoptic broadband, freshly decorated throughout. Within sought-after riverside development with concierge.Larger than average two bedroom apartment set on the fifth floor with direct panoramic river views over London.\nPrivate covered secure parking space included.\nSmart open-plan kitchen with fitted appliances.Bright reception room with space to dine.Master bedroom with fitted wardrobes and en-suite bathroom.Good sized second bedroom with fitted storage.Second family bathroom.\nPrivate balcony boasting far reaching views towards ShardLocated just 10 minutes walk from Canary Wharf tube station, Heron Quays DLR & Crossrail and all the fabulous amenities located within the Canary Wharf estate.\n\nSummary & Exclusions:\n- Rent Amount: £2,773.33 per month (£640.00 per week)\n- Deposit / Bond: £3,199.99\n- 2 Bedrooms\n- 2 Bathrooms\n- Property comes furnished\n- Available to move in from 09 December, 2023\n- Minimum tenancy term is 12 months\n- Maximum number of tenants is 2\n- Students welcome to enquire\n- No Pets, sorry\n- No Smokers\n- Not Suitable for Families / Children\n- Bills not included\n- Property has parking\n- Property has garden access\n- EPC Rating: C\n\n If calling, please quote reference: 1885891 \n\nFees:\nYou will not be charged any admin fees.\n\n\n ** Contact today to book a viewing and have the landlord show you round! ** \nRequest Details form responded to 24/7, with phone bookings available 9am-9pm, 7 days a week.","title":"2 bedroom flat","available":"09/12/2023","price":"£2,769 pcm","agency":"OpenRent, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141655415#/?channel=RES_LET","address":"Hamilton House, 8 Victory Place, London, E14","description":"Knight Frank are pleased to offer this 2nd floor apartment located within the Victory Place development.   The apartment is set over approximately 72.3 sqm (approximately 778 sq ft) and offers reception room, private terrace, separate fully fitted kitchen, principal bedroom with fitted wardrobes and en suite, second bedroom, guest bathroom and one allocated parking space.  The apartment is offered on a furnished basis.\nVictory Place is located next to the Limehouse Basin and within close proximity of both Limehouse Station (0.3 miles) and Westferry DLR (0.4 miles) providing access to both the City and Canary Wharf. All times and distances are approximate.","title":"2 bedroom flat","available":"Ask agent","price":"£2,444 pcm","agency":"Knight Frank - Lettings, Canary  Wharf Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/66k/65872/141655415/65872_CWQ012361204_FLP_00_0001.png"},{"link":"https://www.rightmove.co.uk/properties/141942176#/?channel=RES_LET","address":"Marina Heights Basin Approach London E14","description":"Spectacular two double bedroom spacious furnished apartment offering wonderful unspoilt views of Limehouse Marina located in the sought after development Marina Heights.\n\nThe property comprises of a generous bright reception with dining area leading to the private balcony with direct marina and Canary Wharf skyline views, semi open plan kitchen with integrated appliances, two double bedrooms, the master bedroom benefits from and en suite, bathroom with bath and shower.\n\nOffered fully furnished, with the added benefit of secure parking, and 24 hour concierge.\n\nMarina Heights is ideally located only a few moments to Limehouse station (D.L.R) with easy access to Canary Wharf and Bank.\n\nE.P.C. Rating C\n\nCouncil tax band F\n\nDeposit equivalent to 5 weeks rent required.\n\nDISCLAIMER: Campbell Residential endeavour to advertise accurate representations of properties in descriptions, virtual tours, and floor plans, however, they are intended as a guide only and interested parties must satisfy themselves by undertaking a personal inspection.\nMeasurements are approximate. No responsibility is taken for error or omission or miss statement in these particulars, which do not constitute an offer or contract. No representation of warranty is made or given.","title":"2 bedroom apartment","available":"Now","price":"£2,350 pcm","agency":"Campbell Residential, Docklands Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/51k/50214/141942176/50214_100088004049_FLP_00_0000.png"},{"link":"https://www.rightmove.co.uk/properties/86656566#/?channel=RES_LET","address":"Roosevelt Tower, London E14","description":"The curved open plan living room benefits from a fully fitted kitchen with integrated Smeg appliances. The bathrooms are made with designer bathroom suites, bespoke built in storage, large vanity mirror and tower rails. Underfloor heating keeps you warm in winter. Owner occupied prior, newly renovated in September 2023.\n\nThe development itself features an onsite impressive reception, 24/7 concierge service, roof terrace, communal gardens, and gymnasium.\n\nThe development is located within 4.5 minutes walk of Blackwall DLR, which takes you to Canary Wharf in 4 minutes, and to Bank Station in 10 minutes.\n\nRent: £635 per week\nAs well as paying the rent, you may also be required to make the following permitted payments. If your tenancy does not qualify as an AST, additional fees may apply.\nPlease visit jll.co.uk/fees for details of fees which may be payable when renting a property","title":"2 bedroom flat","available":"Now","price":"£2,752 pcm","agency":"JLL, Canary Wharf Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/213k/212327/86656566/212327_P146308_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/68741964#/?channel=RES_LET","address":"Newport Ave, E14","description":"We are pleased to offer this immaculate two bedroom, two bathroom property situated in the peaceful residential area of Newport Avenue.\n\nThe property is situated on the third floor in Newport Avenue, a secure development with porter services. The property is a generous size with a south facing balcony with partial views of the O2. The two bedoroms are a good size, with the master benefitting from a en-suite bathroom. There is a separate kitchen with a hob and integrated appliances.\n\nSecure parking available for an additional £100 per month\n\nThis property is available with a Deposit Free option which means that instead of paying a traditional five weeks security deposit, you pay a fee of one weeks rent + VAT (subject to a minimum of £120 + VAT) to become a member of a deposit free renting scheme which significantly reduces the up-front costs. This fee is non-refundable and is not a deposit so cannot be used towards covering the cost of any future damage.","title":"2 bedroom flat","available":"28/11/2023","price":"£2,197 pcm","agency":"Felicity J Lord, Canary Wharf Lettings Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141582617#/?channel=RES_LET","address":"Undine Road, Canary Wharf","description":"A recently refurbished and well presented two bedroom maisonette with dock views. The property benefits from a modern separate kitchen and has a large reception area with direct access to a private patio.\n\nForming part of the popular Clippers Quay development, this apartment is extremely well located being just 0.2 miles to Mudchute DLR allowing for quick and easy access into Canary Wharf, Greenwich and The City.","title":"2 bedroom maisonette","available":"Ask agent","price":"£2,097 pcm","agency":"Waterview, Waterview Shad Thames Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/199k/198539/141582617/198539_32702567_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141315914#/?channel=RES_LET","address":"Undine Road, Canary Wharf","description":"A recently refurbished and well presented two bedroom maisonette with dock views. The property benefits from a modern separate kitchen and has a large reception area with direct access to a private patio.\n\nForming part of the popular Clippers Quay development, this apartment is extremely well located being just 0.2 miles to Mudchute DLR allowing for quick and easy access into Canary Wharf, Greenwich and The City.","title":"2 bedroom maisonette","available":"Ask agent","price":"£2,097 pcm","agency":"Dexters, Canary Wharf Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/83k/82537/141315914/82537_32688649_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141631718#/?channel=RES_LET","address":"Caraway Heights, Poplar, London, E14","description":"Presenting a recently refurbished, third floor 881 sq. ft. apartment just 2 minutes' walk from Blackwall DLR. Benefiting from private balcony space facing Canary Wharf & brand new kitchen.\n\nComprising of two large double bedrooms, modernised bathroom, separate  brand new kitchen and large living space. New living room furniture is available upon request - please enquire for further info.\n\nStilring Ackroyd are the sole appointed agent for this property, please call us directly to arrange an appointment.\n\nAvailable with alternative deposit option.","title":"2 bedroom apartment","available":"02/12/2023","price":"£2,000 pcm","agency":"Stirling Ackroyd Lettings, Canary Wharf Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/210k/209807/141631718/209807_CDL170436_L_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141204230#/?channel=RES_LET","address":"Hertsmere Road, London, E14","description":"Light & spacious two bedroom, two bathroom apartment set on the fifth floor of the Horizon Building, Canary Wharf. Featuring large floor-ceiling glazing, wood flooring, integrated modern kitchen and plenty of storage space, the apartment comprises an open plan kitchen/ living room extending onto a large private balcony, master ensuite, a further double bedroom and a family bathroom suite.\r\n\nThe development has a daytime concierge and is located a stone's throw from the West India Quay DLR station. Canary Wharf (Jubilee line) is a stroll from Horizon building as are shops, restaurants and convenience stores at Cabot Place, Canada and Jubilee Place.\r\n\nEPC - B\r\nCouncil band - G","title":"2 bedroom flat","available":"29/11/2023","price":"£2,800 pcm","agency":"Madley Property, Surrey Quays Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/264k/263693/141204230/263693_10HorizonBuilding_FLP_00_0000.png"},{"link":"https://www.rightmove.co.uk/properties/140923115#/?channel=RES_LET","address":"Gainsborough House, Cassilis Road, London, E14","description":"Nestled in the sought-after Canary Central development, this stunning two-bedroom, two-bathroom ground floor apartment boasts a spacious entrance hallway with ample storage, a large living room with floor-to-ceiling windows, and a thoughtfully designed open-plan kitchen that maximizes workspace and storage for your convenience.\n\nWith a round-the-clock concierge service, your packages are always safe and sound upon your return. Plus, residents have access to exclusive leisure facilities, including a fully-equipped gym, a refreshing swimming pool, and the ultimate in relaxation with a luxurious jacuzzi and sauna.\n\nConveniently located just a 10-minute stroll from Canary Wharf and a mere 3-minute walk from the South Quay DLR station","title":"2 bedroom apartment","available":"Now","price":"£2,450 pcm","agency":"Franklyn James, Westferry Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/67k/66685/140923115/66685_32663386_FLP_00_0000.gif"},{"link":"https://www.rightmove.co.uk/properties/141604553#/?channel=RES_LET","address":"1 Fairmont Avenue London E14","description":"The apartment has a spacious open plan reception room with access to a large terrace with spectacular river views, separate fitted kitchen, two double bedrooms (one within en-suite) and modern main bathroom. The property is available furnished and has been well maintained throughout. The apartment also comes with secure parking.\n\nNew Providence Wharf Development offers a 24 hour concierge service, secure parking, leisure facilities which include a sauna, swimming pool and gym. It is also close to all the amenities of Docklands with its many exciting shops, bars, restaurants exhibitions.","title":"2 bedroom apartment","available":"Now","price":"£2,700 pcm","agency":"Cluttons, Wapping - Lettings Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/58k/57124/141604553/57124_P212548_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/140822861#/?channel=RES_LET","address":"Ferguson Close, London, E14","description":"Property Reference: 1855211.\n\nRent directly from the landlord!A two-bedroom flat with direct south-west river views and parking in Canary Wharf.\nThis is a very well appointed, bright and airy second floor apartment set in a purpose-built, low-rise, private development situated on the banks of the river Thames, with beautiful communal gardens, and residential off-street parking.\nExcellent access for Canary Wharf, Greenwich, City, Southbank, West End and Stratford. The flat is just a short walk away from the Mudchute DLR station, a 5 min bus ride or a 15 min walk to Canary Wharf, from where you can take the Jubilee and Crossrail/Elizabeth lines. On your doorstep there is Thames Clipper, at the Masthouse Terrace Pier, service taking you directly to Canary Wharf, City and the West End.The Thames Path is just outside the building and the green spaces of the Millwall Park, the Mudchute Park and City Farm and the Royal Greenwich Park are very close as well. Amenities-wise, the flat is only a short walk away from Asda Superstore, there is a number of doctors’ surgeries and high street shops and restaurants around.Accommodation includes a sun-soaked living room with a separate kitchen (both river facing), two double bedrooms, and a bathroom. The flat is fully furnished and comes with modern appliances and there is even a Juliet balcony to enjoy the views from.This is a perfect pad for busy professionals needing easy access to work and all the attractions London has to offer.Council Tax Band: D\nEPC: B\n\nSummary & Exclusions:\n- Rent Amount: £2,200.00 per month (£507.69 per week)\n- Deposit / Bond: £2,538.46\n- 2 Bedrooms\n- 1 Bathrooms\n- Property comes furnished\n- Available to move in from 12 November, 2023\n- Minimum tenancy term is 12 months\n- Maximum number of tenants is 2\n- No Students\n- No Pets, sorry\n- No Smokers\n- Family Friendly\n- Bills not included\n- Property has parking\n- Property has garden access\n- EPC Rating: B\n\n If calling, please quote reference: 1855211 \n\nFees:\nYou will not be charged any admin fees.\n\n\n ** Contact today to book a viewing and have the landlord show you round! ** \nRequest Details form responded to 24/7, with phone bookings available 9am-9pm, 7 days a week.","title":"2 bedroom flat","available":"Now","price":"£2,200 pcm","agency":"OpenRent, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141928682#/?channel=RES_LET","address":"Dunbar Wharf, \n126-134 Narrow Street, E14","description":"A spacious apartment ideally located in the sought after Limehouse area of Canary Wharf. Comprising 2 bedrooms, 2 bathrooms, spacious reception & fully fitted kitchen the apartment also boasts side River views. The development is located walking distance from Canary Wharf and all the local amenities of Narrow Street. EPC rating C\n\nOur China Desk is here for you, if Chinese is your preferred language, please get in touch via WeChat (ChestertonsChinaDesk)","title":"2 bedroom property","available":"Now","price":"£2,650 pcm","agency":"Chestertons Estate Agents, Canary Wharf & Docklands Lettings Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/44k/43310/141928682/43310_CWL040004_L_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141533606#/?channel=RES_LET","address":"Edison Building, 20 Westferry Road, E14","description":"Enjoy stunning views of the Thames and London skyline from the comfort of your own living room situated on the top of the fourth floor. Located in one of E14’s most desirable developments is this spacious two double bedroom apartment. Accommodation comprises main entrance lobby with entry phone system, entrance hall, large reception room with separate modern kitchen/diner, master bedroom with en suite shower room and built in wardrobes, second double bedroom and main bathroom. \n\nFurther benefits include an allocated parking space, communal gardens, 24 hour concierge and residents gym. Located just a few minutes from Canary Wharf which provides a selection of restaurants and bars. The Jubilee tube line and DLR stations offer superb links into all major parts of the capital.","title":"2 bedroom apartment","available":"21/12/2023","price":"£2,500 pcm","agency":"Franklyn James, Westferry Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/67k/66685/141533606/66685_32699472_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141589124#/?channel=RES_LET","address":"Pierpoint Building, Westferry Road, Canary Wharf E14","description":"A very spacious two double bedroom, two bathroom apartment on the ground floor of the Pierpoint Building within the gated Millennium Harbour development. The apartment includes a spacious living area, separate fitted kitchen with integrated appliances, wood flooring, great amounts of storage space and modern bathroom décor. \n\nThe property further benefits from secure allocated parking, 24-Hour concierge services, leisure facilities to include a gymnasium, Jacuzzi, steam-room and sauna and is located minutes from Canary Wharf and transport links. There are several amenities located nearby including shops and several restaurants. The development is within walking distance of South Quay DLR station, providing a transport link for commutes to Canary Wharf and other destinations across the Capital.\n\nDeposit: Equivalent to 5 weeks’ rent\nCouncil: Tower Hamlets, Tax Band F\nClient Money Protection (CMP) provided by: UKALA\nThe Property Ombudsman Scheme, Membership No: T02100","title":"2 bedroom apartment","available":"Now","price":"£2,600 pcm","agency":"Chase Evans, Docklands Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/50k/49922/141589124/49922_P66501_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141503348#/?channel=RES_LET","address":"Arnhem Wharf, London, E14","description":"Property Reference: 1789157.\n\nExceptional 2 bed, 2 bath flat with over 900 square feet of living space and direct views of the river Thames from the open plan living room kitchen area and master bedroom. Situated in a secure gated and quiet residential development with a local park a stone's throw away, the property benefits from an allocated parking space. Canary Wharf is within walking distance providing transport links via the Jubilee line, DLR and the Elizabeth Line to numerous destinations including the City of London and West End. In addition vibrant Greenwich with ample shops, pubs, markets and a leafy park is accessible via the foot-tunnel at Island Gardens or a short ride on the DLR. Perfect for professionals and young families alike.\n\nSummary & Exclusions:\n- Rent Amount: £2,500.00 per month (£576.92 per week)\n- Deposit / Bond: £2,884.61\n- 2 Bedrooms\n- 2 Bathrooms\n- Property comes furnished\n- Available to move in from 31 October, 2023\n- Minimum tenancy term is 12 months\n- Maximum number of tenants is 2\n- No Students\n- No Pets, sorry\n- No Smokers\n- Family Friendly\n- Bills not included\n- Property has parking\n- No Garden Access\n- EPC Rating: B\n\n If calling, please quote reference: 1789157 \n\nFees:\nYou will not be charged any admin fees.\n\n\n ** Contact today to book a viewing and have the landlord show you round! ** \nRequest Details form responded to 24/7, with phone bookings available 9am-9pm, 7 days a week.","title":"2 bedroom flat","available":"Now","price":"£2,500 pcm","agency":"OpenRent, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141479477#/?channel=RES_LET","address":"St Davids Square, Isle of Dogs, E14","description":"This modern two-bedroom, two-bathroom apartment with a balcony and river views is set in St Davids Square, a sought-after riverside development close to Island Gardens DLR Station and the Greenwich Foot Tunnel. The apartment comprises a bright dual-aspect living room, a separate kitchen with integrated appliances, two ample bedrooms and two modern bathrooms. \n\nResidents have access to a 24-hour concierge service, a gymnasium and a swimming pool. Millwall Park is within walking distance as well as Island Gardens DLR Station, providing transport links for commutes towards Canary Wharf, the City in one direction and Greenwich in the other. Asda superstore and other amenities of Crossharbour are also short distance away.\n\nDeposit: Equivalent to 5 weeks’ rent\nCouncil: Tower Hamlets - Tax Band D\nClient Money Protection (CMP) provided by: UKALA\nThe Property Ombudsman Scheme, Membership No: T02100","title":"2 bedroom apartment","available":"03/01/2024","price":"£2,730 pcm","agency":"Chase Evans, Docklands Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141464270#/?channel=RES_LET","address":"Royal Captain Court, Blackwall Reach, Canary Wharf E14","description":"A luxury two bedroom apartment in this brand new ground-breaking development in E14. Comprising large living/dining area, fitted kitchen with integrated appliances, private winter garden, two sizable bedrooms with fitted wardrobes, master en suite and pristine bathroom suite.\n\nResidents benefit from a concierge and quick access to transport links including Blackwall Station offering access to Canary Wharf in 8 minutes. Canary Wharf Underground operates a range of services across the capital which currently include DLR and Jubilee line and in future will be serviced by the high speed Crossrail, makes commutes to Areas such as Bank achievable in just 14mins or 24 minutes.\n\nDeposit: Equivalent to 5 weeks’ rent\nCouncil: Tower Hamlets, Tax Band E\nClient Money Protection (CMP) provided by: UKALA\nThe Property Ombudsman Scheme, Membership No: T02100","title":"2 bedroom apartment","available":"19/12/2023","price":"£2,600 pcm","agency":"Chase Evans, Canary Wharf Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/29k/28238/141464270/28238_P67187_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141462806#/?channel=RES_LET","address":"Manchester Road, \nCubitt Town, E14","description":"A large two double bedroom apartment in the Pierhead Lock development. The property comprises of two double bedrooms, reception with access to private balcony with river views and bathroom and is available fully furnished. Only a short walk to South Quay DLR. EPC rating C.\n\nOur China Desk is here for you, if Chinese is your preferred language, please get in touch via WeChat (ChestertonsChinaDesk)","title":"2 bedroom property","available":"Now","price":"£2,496 pcm","agency":"Chestertons Estate Agents, Canary Wharf & Docklands Lettings Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/44k/43310/141462806/43310_CWL160042_L_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141795158#/?channel=RES_LET","address":"New Providence Wharf, \nFairmont Avenue, E14","description":"Modern two bedroom apartment set on the 6th floor in New Providence Wharf. With direct river views, the apartments boasts a spacious reception room with balcony, modern kitchen, two double bedrooms and two sleek bathrooms. 24hr concierge & gym.\n\nOur China Desk is here for you, if Chinese is your preferred language, please get in touch via WeChat (ChestertonsChinaDesk)","title":"2 bedroom property","available":"Now","price":"£2,750 pcm","agency":"Chestertons Estate Agents, Canary Wharf & Docklands Lettings Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/44k/43310/141795158/43310_CWL230430_L_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141820265#/?channel=RES_LET","address":"Millharbour, London, E14","description":"This spacious and beautifully furnished two-bedroom, two-bathroom flat offers the perfect blend of modern living and convenience. \n\nAs you step into this stylish apartment, you'll be greeted by an open and bright living space. The living room features large windows that fill the room with natural light, creating a warm and inviting atmosphere. It's the ideal space for relaxation and entertaining.\n\nThe well-equipped kitchen boasts modern appliances, ample storage, and a sleek design that will inspire your inner chef. Whether you're preparing a quick breakfast or hosting a dinner party, this kitchen has you covered.\n\nThe two bedrooms are generously sized and come with comfortable furnishings, making it easy to unwind and get a good night's rest. The master bedroom features an en-suite bathroom for added privacy and convenience.\n\nBoth bathrooms are elegantly designed and equipped with all the amenities you need for a refreshing start to your day or a soothing end in the evening.\n\nThis flat also offers the convenience of in-unit laundry facilities and ample storage throughout. Additionally, residents have access to on-site amenities, such as a fitness center and a communal garden.\n\nLocated in the vibrant Millharbour E14 area, you'll be within easy reach of Canary Wharf, local restaurants, shopping, and excellent transportation links. Whether you're a young professional or a family, this flat offers the perfect combination of comfort and convenience in one of London's most sought-after neighborhoods.\n\nFor more information about our fees please visit our web-site’s ‘Tenant Fees’ page located under the Rent tab.\n\n CBRE Limited on its behalf and for the Vendors or Lessors of this property whose Agents they are, give notice that:\n\n1. These particulars are set out as a general outline only for guidance to intending Purchasers or Lessees, and do not constitute any part of an offer or contract.  \n2.Whilst CBRE Limited uses reasonable endeavours to ensure that the information in these particulars is materially correct, some of the information is derived from third parties and has not been verified by us. Any intending Purchasers, Lessees or Third Parties should not rely on this information as a statement or representation of fact, but must satisfy themselves by their own inspection, searches, enquiries, surveys or otherwise as to the accuracy and completeness.\n3. To the maximum extent permitted by law CBRE Limited accepts no liability or responsibility for any loss or damage including without limitation, indirect or consequential loss or damage, or any loss of profits resulting from direct or indirect actions based upon the content of these particulars. No person in the employment of CBRE Limited has any authority to make any representation or warranty whatsoever in relation to this property.\n4. Unless otherwise stated, all purchase prices and rents are correct at the date of publication and, unless otherwise stated,  are quoted exclusive of VAT.  Lease details and service ground rent (where applicable) are given as a guide only and should be checked and confirmed by your solicitor prior to exchange of contracts.","title":"2 bedroom apartment","available":"Ask agent","price":"£2,492 pcm","agency":"CBRE Residential, Docklands Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/37k/36789/141820265/36789_CAR150122_L_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141266033#/?channel=RES_LET","address":"New Providence Wharf, \nFairmont Avenue, E14","description":"Luxury two bedroom apartment set on the 9th floor in New Providence Wharf. With direct river views, the apartments boasts a spacious reception room with balcony, modern kitchen, two double bedrooms and two sleek bathrooms. 24hr concierge & gym.\n\nOur China Desk is here for you, if Chinese is your preferred language, please get in touch via WeChat (ChestertonsChinaDesk)","title":"2 bedroom property","available":"Now","price":"£2,750 pcm","agency":"Chestertons Estate Agents, Canary Wharf & Docklands Lettings Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/44k/43310/141266033/43310_CWL230413_L_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141457178#/?channel=RES_LET","address":"Luralda Wharf, Canary Wharf","description":"Situated within the sought after Luralda Wharf, only minutes away from Isle Gardens Station and surrounded by amenities, is this newly decorated two bedroom second floor apartment. This spacious property comprises of a large open plan kitchen and living space, two generous double bedrooms and a modern bathroom. \n\nThe balcony overlooks the stunning Isle Gardens Park with views of the River Thames. \n\nThis property also benefits from residential parking and a single car garage. \n\nCouncil Tax Band: F\n Tenancy Length: Minimum 12 months (break clause considered on request)","title":"2 bedroom apartment","available":"18/11/2023","price":"£2,100 pcm","agency":"Oakland Estates, Barkingside Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141448814#/?channel=RES_LET","address":"Lime Kiln Wharf, London, E14","description":"Property Reference: 1880789.\n\nTwo-bedroom waterfront flat with underground parking is available to let in the popular Lime Kiln Wharf building off Narrow Street.\n\nThe property is beautifully finished with lovely bathroom and kitchen, all in good condition. \n\nFlat enjoys Thames views from a spacious balcony.\n\nThe development is extremely secure and well-kept. Pets are allowed.\n\nProperty is available to rent from 1st of December.\n\nSituated over a generous 75 sq.m.Gated River development with beautifully maintained communal gardens.Balcony with the Thames view.2 double bedrooms.2 bathrooms ( 1 en suite).Separate kitchen with integrated SMEG appliances.The property is available from 1st of December 2023.\n3 minutes walk to Westferry DLR.7 minutes walk to Cross Rail and Canary Wharf Jubilee Line.4 minutes walk to the Thames Clipper boat service.Video entry system. CCTV throughout. Garage / Underground Parking space is included. Can be let Furnished or semi-furnished.The property has wood flooring throughout.\nPrivate landlord-managed property.No agency fees. Direct hassle-free contact with the landlord.Standard 5 weeks rent deposit is required.The well laid out apartment comprises a large, bright reception room that leads onto a self contained kitchen equipped with fully integrated appliances, 2 spacious bedrooms with large built-in wardrobe, traditional family bathroom and an en-suite to the master bedroom. This property is ideally situated for local and national rail links, and is minutes from City and Bank as well as many of London's finest locations. Close to the Thames Path, this property provides the opportunity for peaceful walks into the Tower Hill and City.For more information, please send a message.\n\nSummary & Exclusions:\n- Rent Amount: £2,300.00 per month (£530.77 per week)\n- Deposit / Bond: £2,653.84\n- 2 Bedrooms\n- 2 Bathrooms\n- Property comes furnished\n- Available to move in from 01 December, 2023\n- Minimum tenancy term is 3 months\n- Maximum number of tenants is 3\n- Students welcome to enquire\n- Pets considered / by arrangement\n- No Smokers\n- Family Friendly\n- Bills not included\n- Property has parking\n- Property has garden access\n- EPC Rating: B\n\n If calling, please quote reference: 1880789 \n\nFees:\nYou will not be charged any admin fees.\n\n\n ** Contact today to book a viewing and have the landlord show you round! ** \nRequest Details form responded to 24/7, with phone bookings available 9am-9pm, 7 days a week.","title":"2 bedroom flat","available":"01/12/2023","price":"£2,300 pcm","agency":"OpenRent, London Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/97k/96668/141448814/96668_188078930102023_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141428126#/?channel=RES_LET","address":"Manchester Road, Canary Wharf","description":"A well-proportioned two bedroom apartment set within a riverside development in Canary Wharf. Recently refurbished with new wooden flooring and redecorated throughout. The property is offered furnished with parking available by negotiation.\n\nPierhead Lock is a gated complex near to South Quay DLR Station and within easy reach of the shops, bars, restaurants of Canary Wharf, which also has access to the Jubilee Line and Cross Rail services.","title":"2 bedroom flat","available":"Ask agent","price":"£2,496 pcm","agency":"Dexters, Canary Wharf Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/83k/82537/141428126/82537_32694117_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141367991#/?channel=RES_LET","address":"Caledonian Wharf, London, E14","description":"Chanin Estates are proud to present this mid-terraced house that offers generous living space, this excellent two bedroom house has a light and contemporary interior.\n\nThe property comprises of a spacious reception room with access to your own private garden, a modern kitchen and two good sized bedrooms with excellent storage.\n\nCaledonian Wharf benefits from a selection of local amenities within easy reach of the Mudchute Park Station (DLR) surrounding area. \n\nExcellent local transport links and easy access to Canary Wharf and beyond.\n\nCall now to book in a viewing. \n\nAvailableNow.","title":"2 bedroom terraced house","available":"Now","price":"£2,200 pcm","agency":"Chanin Estates, London Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/123k/122146/141367991/122146_102299001283_FLP_00_0000.png"},{"link":"https://www.rightmove.co.uk/properties/141357884#/?channel=RES_LET","address":"Studley Court, 5 Prime Meridian Walk, London, E14","description":"A large two-bedroom, two-bathroom apartment situated on 6th floor offering direct views over the River Thames. The property comprises of a separate kitchen, two large double bedrooms, a large private balcony and a 24-hour concierge service and off-street parking. Ideally located for commuters with it being walking distance to East India DLR station.\n\nCouncil Tax Band E","title":"2 bedroom flat","available":"09/12/2023","price":"£2,100 pcm","agency":"Keatons, Bow Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/26k/25055/141357884/25055_AOS210098_L_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141309167#/?channel=RES_LET","address":"Limeharbour, 3 Limeharbour, E14","description":"One Move Group is delighted to present this magnificent twobedroom, two-bathroom apartment that offers both spaciousness and modern design, boasting splendid city views of Canary Wharf. Located just a stone's throw away from Crossharbour Station (DLR) and mere minutes from Canary Wharf Station (Jubilee Line/DLR), this 5th floor apartment is a true gem.Step inside to find an inviting open-plan kitchen and reception area, perfect for entertaining guests. The apartment features a generously sized family bathroom, while the master bedroom comes with an en-suite bathroom, providing convenience and privacy. Additionally, there is a second well-proportioned double bedroom, with both the reception area and master bedroom enjoying access to their separate balconies.Residents of this development can take advantage of the fantastic amenities, including 24-hour concierge service for added convenience and peace of mind. Moreover, exclusive communal gardens offer a tranquil escape within the bustling city.","title":"2 bedroom flat","available":"Now","price":"£2,350 pcm","agency":"One Move Group, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/140994788#/?channel=RES_LET","address":"Westferry Road, Canary Wharf","description":"A well presented two bedroom apartment on the 16th floor of Cascades Tower. This property has two double bedrooms, two bathrooms and a balcony facing the Thames.\n\nCascades Tower is moments from the shops, bars and restaurants of Westferry Circus, including the popular Royal China.","title":"2 bedroom flat","available":"Ask agent","price":"£2,600 pcm","agency":"Waterview, Waterview Shad Thames Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/199k/198539/140994788/198539_32668073_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/140708987#/?channel=RES_LET","address":"Westferry Road, Canary Wharf","description":"A well presented two bedroom apartment on the 16th floor of Cascades Tower. This property has two double bedrooms, two bathrooms and a balcony facing the Thames.\n\nCascades Tower is moments from the shops, bars and restaurants of Westferry Circus, including the popular Royal China.","title":"2 bedroom flat","available":"Ask agent","price":"£2,600 pcm","agency":"Dexters, Canary Wharf Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/83k/82537/140708987/82537_32631937_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/140465612#/?channel=RES_LET","address":"Ability Place, 37 Millharbour, Canary Wharf London E14 9HB","description":"Century 21 Heritage is proud to present this modern and contemporary two bedroom apartment located on the first floor of Ability Place. Spanning an approximate 835 square feet, this apartment offers spacious living, access to a private balcony, walking distance to local amenities around Canary Wharf and is within a short walk away from South Quay DLR Station.\n\nWell sized apartment located on the first floor of Ability Place in Millharbour. Offering an approximate 835 square feet, the accommodation comprises of living area with built in wardrobe, fully fitted kitchen with integrated appliances such as fridge/freezer, hob, dishwasher and built-in microwave and bathroom suite with access to private balcony.Ability Place offers lift access to all floors, and entry-phone system to all apartments. The development benefits from concierge service and resident's gym. Millharbour is located in the residential area of Canary Wharf with is wealth of shops, restaurants and bars within walking distance. The nearest station is South Quay DLR with its links into the City, Central and South London. Resident's are also a short walk away from Canary Wharf Station which offers Jubilee Line services towards North West and East London and DLR services to Central London.","title":"2 bedroom apartment","available":"Now","price":"£2,695 pcm","agency":"Century 21 Heritage, Newham Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141271877#/?channel=RES_LET","address":"Royal Captain Court, 26 Arniston Way, Greater London, E14","description":"This twobedroom apartment is finished to the highest specification designed to provide luxurious comfort. As well as two double bedrooms, an en suite and family bathroom the property also boasts a stunning winter garden area.\n\nThe apartment benefits from on site concierge offering parcel collection and a key holding service, lifts to all floors in the building, a secure cycle store, video entry system and CCTV across the development for additional security as well as a dedicated property manager for your block offering continuity, local knowledge and practical knowledge of your property.\n\n*Our photos are indicative of the style & finish of the properties and are taken from our marketing suite at the development. The available property is a two bedroom North East facing property on the 21st Floor.\n\nThe Local Area\nWith Blackwall DLR on your doorstep this property really is at the heart of London.\n\nCanary Wharf – 8 Minutes (DLR)\nLondon City Airport – 10 Minutes (DLR)\nRepublic London ­Local coffee shops, restaurants & gym – 8 Minutes (Walk)\nThe O2 Entertainment Venue – 15 Minutes (DLR/Tube)\nLocal Supermarket – 4 Minutes (Walk)\n\nI am Interested!\nIf you are interested in arranging a viewing then please register your interest via this advertisement or direct with our office via e-mail at   & we’ll get in touch to discuss your requirements & arrange a viewing with you. \n\nYour Tenancy & Our Fees\n\nYour Tenancy\nWe'll offer you a tenancy to suit you. All tenancies we offer are for 3 years with a 6 month break clause and rent capped at index-linked CPI.\n\n Holding Deposit - Equivalent to one weeks rent\nThis charge is payable per property and confirms your intent to proceed with the proposed tenancy. The fee is payable prior to referencing for the property. This payment will be deducted from your move in monies should you be successful with an offer of tenancy for the property. \n\n Deposit - Equivalent to 5 weeks rent\nA deposit equivalent to 5 weeks rent will be held to protect your landlord should you fail to meet the obligations under your tenancy. Your deposit will be protected with the Deposit Protection Service (DPS). No deductions can be made from your deposit at the end of your tenancy without your agreement and should you wish to dispute a claim you can do so using the DPS Dispute Resolution Service.\n\nA deposit of 5 weeks rent, minus your holding deposit and the first month’s rent in advance will be due prior to move in to the property.","title":"2 bedroom apartment","available":"Now","price":"£2,700 pcm","agency":"Hera Management Services, Billericay Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/80k/79351/141271877/79351_371_FLP_00_0000.png"},{"link":"https://www.rightmove.co.uk/properties/140717669#/?channel=RES_LET","address":"Boardwalk Place, London, E14","description":"This spacious apartment is in excellent condition throughout and has more than 900sqft of living space with all principal rooms facing towards the Marina.\n\nThe property will be newly decorated throughout with new carpets prior to any new tenancy starting.\n\nThis well located apartment has two double bedrooms both with a good amount of wardrobe space and 3/4 height windows allow for plenty of natural light.\n\nA well proportioned living room has ample dining space and full height sliding windows leading to a lovely balcony offering far reaching easterly views towards the marina and the river.\n\nThis apartment also comes with two modern bathroom suites, a fully fitted kitchen with integrated appliances and a secure allocated parking can be arranged.\n\nBoardwalk Place is in a fabulous location, being one of the closest residential developments to the Canary Wharf Estate. Both the Jubilee Line and Crossrail are just a few minutes walk away allowing for quick and easy access to West London.\n\n** HOW TO ARRANGE A VIEWING: The quickest way to enquire about this property is to register your interest via the enquiry button on this website. Well send you an email a moment later with an online enquiry form for you to complete. The landlord will then contact you directly to arrange your viewing **\n\nDeposit: £3,057\n\nSorry, no students, pets or company lets\n\nEnergy efficiency rating: 81 – Band B\n\nCouncil Tax Band: B\n\nReference: 008333\n\nPlease note, by submitting an enquiry regarding this property you agree that we may send your details to the landlord of this property so they may contact you in order to answer any questions, or arrange a convenient viewing time. STRICTLY NO AGENT OR SUB-LETTING CALLS.","title":"2 bedroom apartment","available":"Now","price":"£2,650 pcm","agency":"The Online Letting Agents Ltd, Bury St Edmunds Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/83k/82831/140717669/82831_8333_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141220880#/?channel=RES_LET","address":"Proton Tower, 8 Blackwall Way, London, E14 9GN","description":"Domeview Properties are delighted to offer this 2 double bedroom apartment in the popular Proton Tower development in East India. \n\nThe apartment comprises, 2 double bedrooms, 2 bathrooms, (1 ensuite), fully integrated kitchen and open plan reception room with a great view. \n\nThe Proton Tower development is A popular choice for professionals working in Canary Wharf and Docklands which is just 10-12 minutes walk from the property or a short trip on the DLR.","title":"2 bedroom flat","available":"Now","price":"£2,300 pcm","agency":"Domeview Properties, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141209537#/?channel=RES_LET","address":"Westferry Road, London, E14","description":"Property Reference: 1874057.\n\nCascades Tower is located in the heart of Canary Wharf.This apartment comprises of: - Two double bedrooms- Two bathrooms- A spacious reception room- A private balcony offering views towards Canary Wharf- Secure Parking SpaceWith 5 star on-site facilities including: - Resident's tennis courts- Heated riverside swimming pool- Sauna- Jacuzzi- Gym- 24-hour concierge serviceCascades Tower is extremely well located being within just a few minutes’ walk from the centre of Canary Wharf and Canary Wharf tube station (Jubilee line and Elizabeth line)Central heating is included in the monthly rent.\n\nSummary & Exclusions:\n- Rent Amount: £2,575.00 per month (£594.23 per week)\n- Deposit / Bond: £2,971.15\n- 2 Bedrooms\n- 2 Bathrooms\n- Property comes furnished\n- Available to move in from 24 October, 2023\n- Minimum tenancy term is 6 months\n- Maximum number of tenants is 2\n- Students welcome to enquire\n- No Pets, sorry\n- No Smokers\n- Family Friendly\n- Bills not included\n- Property has parking\n- Property has garden access\n- EPC Rating: C\n\n If calling, please quote reference: 1874057 \n\nFees:\nYou will not be charged any admin fees.\n\n\n ** Contact today to book a viewing and have the landlord show you round! ** \nRequest Details form responded to 24/7, with phone bookings available 9am-9pm, 7 days a week.","title":"2 bedroom flat","available":"Now","price":"£2,575 pcm","agency":"OpenRent, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141161894#/?channel=RES_LET","address":"Langbourne Place, Westferry Road, Docklands E14","description":"A two double bedroom, two bathroom furnished apartment set within a gated development located near the River Thames. This apartment includes a spacious living area, separate fitted kitchen with integrated appliances, wood flooring, electric heating, and bathroom tiling. \n\nResidents will also have access to off street parking. The development is near to Mudchute DLR station, providing a valuable transport link for commutes to key destinations within the Capital.\n\nDeposit: Equivalent to 5 weeks’ rent\nCouncil: Tower Hamlets, Tax Band D\nClient Money Protection (CMP) provided by: UKALA\nThe Property Ombudsman Scheme, Membership No: T02100","title":"2 bedroom apartment","available":"18/11/2023","price":"£2,102 pcm","agency":"Chase Evans, Docklands Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/50k/49922/141161894/49922_P67091_FLP_00_0001.jpeg"},{"link":"https://www.rightmove.co.uk/properties/70208099#/?channel=RES_LET","address":"Pierpoint Apartment, Westferry Road, London, E14 8NQ","description":"**Available 2nd October**\r\n\nThis very spacious two-bedroom apartment (over 1000sqf) is located on the ground floor in the prestigious Millennium Harbour development in the Docklands with a large communal terrace.\r\n\nThis fully furnished property offers 2 double bedrooms both with fitted wardrobes, 2 bathrooms, modern fitted kitchen with granite work surfaces and wooden flooring throughout.\r\n\nThe development is gated with 24 hour concierge and luxurious leisure facilities to include a gym, Jacuzzi, steam-room and sauna. Located within easy walking distance Canary Wharf Underground station and Thames Clipper ferry.\r\n\nZuker Property now provides bills all inclusive option for each tenancy, these can include (if applicable) water, electricity, gas, broadband, TV licence. Council tax is still payable by the tenants themselves.","title":"2 bedroom flat","available":"Now","price":"£2,700 pcm","agency":"Zuker Property Ltd, Birmingham Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141132947#/?channel=RES_LET","address":"Boardwalk Place, Canary Wharf E14 5GD","description":"Wonderful waterside two bedroom, two bathroom apartment with a balcony in a contemporary development overlooking Blackwall Basin in Canary Wharf. The apartment comprises a fully integrated kitchen, ample living room, a master bedroom with an en suite bathroom, a further double bedroom and a bathroom. \n\nResidents will also have access to a 24-hour concierge service. There are amenities located nearby including restaurants, cafés and shops. The development is located near to the transport links and amenities of Canary Wharf.\n\nDeposit: Equivalent to 5 weeks’ rent\nCouncil: Tower Hamlets, Band E\nClient Money Protection (CMP) provided by: UKALA\nThe Property Ombudsman Scheme, Membership No: T02100ted just a short walk from Canary Wharf and surrounding transport links.","title":"2 bedroom apartment","available":"06/12/2023","price":"£2,600 pcm","agency":"Chase Evans, Canary Wharf Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141517493#/?channel=RES_LET","address":"Queens Court, Limehouse, E14","description":"A bright and spacious two double bedroom two bathroom apartment in this desirable Limehouse development located just off Narrow Street. The property is offered furnished and benefits from impressive park views, three balconies and parking. The spacious lounge has floor to ceiling windows, the kitchen is fully fitted and there is ample storage throughout. Both bathrooms have been updated and there is wood flooring throughout. Brightlingsea Place is within walking distance to either Limehouse or Westferry DLR and Canary Wharf is also within close proximity.","title":"2 bedroom apartment","available":"29/11/2023","price":"£2,500 pcm","agency":"Franklyn James, Limehouse and Wapping Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141090248#/?channel=RES_LET","address":"Roy Square London E14","description":"An exceptionally well presented two bedroom apartment located in a gated development on Narrow Street, Limehouse.\nThe apartment comprises; bright open-plan living area with modern integrated kitchen with access to a large balcony, large separate bathroom, two double bedrooms, with one having access to a balcony over looking the communal gardens.\n\nThe Watergardens benefits from gated security and communal gardens. Narrow Street offers access to Canary Wharf and The City via the Thames Path and DLR. There is also a selection of river fronted bars and restaurants.","title":"2 bedroom apartment","available":"Now","price":"£2,275 pcm","agency":"Cluttons, Wapping - Lettings Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/58k/57124/141090248/57124_P212497_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/140873678#/?channel=RES_LET","address":"Pierpoint Building, 16 Westferry Road, London, E14","description":"Discover the epitome of modern urban living in this elegant 2-bedroom apartment located in the sought-after Pierpoint development in E14. This contemporary residence offers a combination of comfort and convenience.\n\nKey Features:\nSpacious Living: This apartment offers a generously sized living area that is flooded with natural light, creating a welcoming and inviting atmosphere.\nModern Kitchen: The open-plan kitchen is equipped with top-of-the-line appliances, making it a perfect space for culinary enthusiasts.\nTwo Bedrooms: Two well-appointed bedrooms provide ample space for relaxation and rest. The master bedroom features an en-suite bathroom for added privacy.\nLuxurious Bathrooms: The apartment boasts stylish and modern bathrooms, enhancing your daily routine.\nPrivate Balcony: Step out onto your private balcony to enjoy breathtaking views of the surrounding area, a perfect spot to unwind after a long day.\nConcierge Service: The Pierpoint development offers a dedicated concierge service, ensuring that all your needs are met.\nTransport Links: Located within easy reach of public transportation, including DLR and London Underground stations, commuting is a breeze. You'll have quick access to Canary Wharf and the heart of London.\nLocal Amenities: The apartment is situated close to a plethora of shops, restaurants, and entertainment options, providing an enviable lifestyle for residents.\nSecure Living: Security features within the development offer peace of mind to its residents.\n\nThis 2-bedroom apartment in Pierpoint, E14, is the perfect choice for professionals, couples, or small families looking for a stylish and convenient place to call home. To experience the height of contemporary living, contact us today to schedule a viewing. Council Tax Band:  Holding Deposit: £600.00","title":"2 bedroom apartment","available":"Now","price":"£2,600 pcm","agency":"John D Wood & Co, Docklands & City, Docklands & City Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/48k/47285/140873678/47285_000801568_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/140253518#/?channel=RES_LET","address":"Westferry Circus, London, E14","description":"Fantastic two double bedroom, two bathroom apartment on the 5th floor this popular development with concierge. Apartments comes with one secure underground parking space. Furnished/Unfurnished. Available 17th November 2023\r\n\nEarly viewings highly recommended.","title":"2 bedroom apartment","available":"17/11/2023","price":"£2,800 pcm","agency":"Tower Quay Limited, London Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/56k/55234/140253518/55234_BCRE51A_FLP_00_0000.png"},{"link":"https://www.rightmove.co.uk/properties/141590933#/?channel=RES_LET","address":"Meridian Place, Canary Wharf","description":"A bright two bedroom apartment on the first floor of this sought after development. This large apartment has two bathrooms, ample storage and a private balcony.\n\nMeridian Place is moments away from the bars and restaurants of South Quay, including the popular Lotus Floating Restaurant.","title":"2 bedroom flat","available":"Ask agent","price":"£2,197 pcm","agency":"Waterview, Waterview Shad Thames Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141032294#/?channel=RES_LET","address":"Selsdon Way, Canary Wharf","description":"A two bedroom apartment in City Harbour. This property has two double bedrooms, two bathrooms, a private balcony, open plan reception and comes furnished.\n\nCity Harbour is within walking distance of the Mudchute farm, the Docklands sailing centre and all local shops, bars and Restaurants in central Canary Wharf.","title":"2 bedroom flat","available":"Ask agent","price":"£2,535 pcm","agency":"Waterview, Waterview Shad Thames Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/140928320#/?channel=RES_LET","address":"Lowry House, Cassilis Road, E14","description":"Regent are pleased to present this smart property enjoys a premier Docklands location within walking-distance of Canary Wharf. \n\nThe modern apartment would suit professional sharers, comprising two double bedrooms, two full bathrooms (one en-suite to master) and an open-plan kitchen/living area. Residents will also appreciate a private south-facing balcony. \n\nLowry house boasts a host of private residents' facilities including health spa with heated indoor pool, sauna, Jacuzzi & gymnasium, communal gardens, and porter service. \n\nLowry House is a gated development a mere seven-minute walk away from South Quay DLR station or 10 minutes' walk from the heart of Canary Wharf, which is expected to welcome Crossrail services to destinations across London and the South East from 2018.\n\nRegent Property comply with the Tenant Fees Act 2019 and are members of The Property Ombudsman scheme. Our Client Money Protection is provided by the UKALA Total Loss CMP scheme. For more information please visit our website   or call our office on  .","title":"2 bedroom apartment","available":"08/12/2023","price":"£2,550 pcm","agency":"Regent Letting and Property Management, London Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/88k/87187/140928320/87187_30271_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141859418#/?channel=RES_LET","address":"Indescon Square, Canary Wharf, London, E14","description":"When you get a spare moment, you will want to come and see this stunning Two Bedroom / Two Bathroom apartment.\n\nThe apartment sits in the Indescon Square development where you can sit back and enjoy the view from one of your two balconies. Enjoy your own paradise of comfort and modernity in the open plan kitchen and living room, where cooking and watching your favourite TV series goes hand in hand. \nNo more London box bedrooms for you, as the spacious bedroom allows you to wake up in style with floor to ceiling windows. Sometimes living in the city can be noisy, but living here offers a moment of rare tranquillity amongst the popular business districts, with no busy roads outside your door.\n\nThe local area provides you with close by shops as well as all the amenities Canary Wharf has to offer. The 24hr concierge are always on hand to help you collect parcels or even just to make you feel safe whilst walking around the development. Situated only 0.5 miles from Canary Wharf Tube station and 0.4 miles from South Quay DLR, commuting to work, whether you work in Canary Wharf itself or the City, is easy. \n\nDoes this sound like the perfect place for you? Give us a call on   to arrange a viewing while it is still fresh on the market.","title":"2 bedroom apartment","available":"16/11/2023","price":"£2,400 pcm","agency":"Life Residential, Canary Wharf Office - Lettings Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/53k/52518/141859418/52518_CWL230094_L_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/140884673#/?channel=RES_LET","address":"Dundee Wharf, London, E14","description":"Property Reference: 1827246.\n\nWe are proud to offer this delightful 2 bedroom, 2 bathroom flat in a great location.\n\nAvailable to move in from 15 November 2023, this property benefits from available parking, and garden access. Property is offered furnished.\n\nViewing highly recommended. Contact OpenRent today for more details or to arrange a viewing! \n\nSummary\n\nRent £2,750.00 per month (£634.62 per week)\nDeposit / Bond is £3,173.07\n\nMinimum tenancy is 6 months\nMaximum number of tenants is 3\n\nSummary & Exclusions:\n- Rent Amount: £2,750.00 per month (£634.62 per week)\n- Deposit / Bond: £3,173.07\n- 2 Bedrooms\n- 2 Bathrooms\n- Property comes furnished\n- Available to move in from 15 November, 2023\n- Minimum tenancy term is 6 months\n- Maximum number of tenants is 3\n- Students welcome to enquire\n- No Pets, sorry\n- No Smokers\n- Family Friendly\n- Bills not included\n- Property has parking\n- Property has garden access\n- EPC Rating: C\n\n If calling, please quote reference: 1827246 \n\nFees:\nYou will not be charged any admin fees.\n\n\n ** Contact today to book a viewing and have the landlord show you round! ** \nRequest Details form responded to 24/7, with phone bookings available 9am-9pm, 7 days a week.","title":"2 bedroom flat","available":"15/11/2023","price":"£2,750 pcm","agency":"OpenRent, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/86654475#/?channel=RES_LET","address":"New Providence Wharf, Canary Wharf, London, E14","description":"LONG LET. Set within the fabulous, riverside New Providence Wharf development, this stunning two bedroom flat benefits from wood floors throughout, stylish, contemporary décor, balcony with far-reaching views and concierge.\n\nNew Providence Wharf is ideally located for the Canary Wharf business district and the comprehensive selection of shops, bars and restaurants at Churchill Place. For those wishing to travel into central London Blackwall DLR Station is also nearby. \n\nPlease use the reference CHPK0134781 when contacting Foxtons.","title":"2 bedroom flat","available":"Ask agent","price":"£2,579 pcm","agency":"Foxtons, Canary Wharf Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/49k/48101/86654475/48101_1258106_FLP_00_0000.png"},{"link":"https://www.rightmove.co.uk/properties/86643396#/?channel=RES_LET","address":"Naxos Building, Hutching Street, Canary Wharf, South Quay, London, E14 8JR","description":"Jack Barclay Estates London are offering an impressive 2 bedroom 1 bathroom apartment with riverside views in the ever growing Naxos Building Development on Millenium Harbour, Canary Wharf, E14.\nThis spectacular apartment comprises of a generous lounge area, two stunning double bedrooms, two bathrooms, a balcony, the apartment is finished to good standard throughout including a high spec'ed kitchen which has integrated kitchen appliances also include communal facilities such as gym, steam room, sauna and A library.\n\nNaxos Tower is situated along Westferry Road and is only a short walk away from South Quay DLR station which allows easy access into Canary Wharf where you will find a range of cafes, bars & restaurants.","title":"2 bedroom flat","available":"Ask agent","price":"£2,383 pcm","agency":"Jack Barclay Estates, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141179828#/?channel=RES_LET","address":"Arnhem Wharf, \n2 Arnhem Place, E14","description":"This spacious two bedroom flat located on a quiet Riverside development offers a contemporary interior and fabulous views over the London skyline and across the River Thames from its private balcony.\n\nOur China Desk is here for you, if Chinese is your preferred language, please get in touch via WeChat (ChestertonsChinaDesk)","title":"2 bedroom property","available":"21/11/2023","price":"£2,400 pcm","agency":"Chestertons Estate Agents, Canary Wharf & Docklands Lettings Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/86616777#/?channel=RES_LET","address":"Selsdon Way, Canary Wharf","description":"A two bedroom apartment in City Harbour. This property has two double bedrooms, two bathrooms, a private balcony, open plan reception and comes furnished.\n\nCity Harbour is within walking distance of the Mudchute farm, the Docklands sailing centre and all local shops, bars and Restaurants in central Canary Wharf.","title":"2 bedroom flat","available":"Ask agent","price":"£2,535 pcm","agency":"Dexters, Canary Wharf Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/86310777#/?channel=RES_LET","address":"Gainsborough House, London, E14","description":"Property Reference: 1836452.\n\nGainsboroughHouse, Cassilis Road, London, E14 2 bedroom apartment fully furnishedMain Features-      2 Double Bedrooms Apartment-      677 Square Feet-      2 Large Bathrooms-      Large Open Plan Lounge-      Fully Fitted Kitchen-      Private Balcony-      Residents Gym and Sauna-      Residents Swimming Pool-      Great Local Amenities-      Excellent Transport Links-      SouthQuay DLR Station 2 minutesProperty Description:This is a stunning 2 bedroom apartment in a close proximity to Canary Wharf in a very sought after development and available fully furnished. \n\nThis apartment comprises of two bright and spacious bedrooms, two modern fitted bathrooms, one of them is an en-suite for the main bedroom.It has a bright and spacious lounge with floor to ceiling windows which opens up to a private balcony. There is a fully fitted kitchen with integrated appliances along with a dishwasher. It has been renovated last year with new wooden floor in the lounge and hallway, new  carpet in the bedrooms. It is presented beautifully and a very good standard. \n\nThe Canary Central development is well located for commuting and the shops, restaurants and banking institutions of Canary Wharf.  It comes with a residential gym, swimming pool and a 24 hours concierge service.  South Quay DLR station is only minutes away from the property with Canary Wharf A private underground parking is available at a slight premium.\nService charge contribution\n\nSummary & Exclusions:\n- Rent Amount: £2,575.00 per month (£594.23 per week)\n- Deposit / Bond: £2,575.00\n- 2 Bedrooms\n- 2 Bathrooms\n- Property comes furnished\n- Available to move in from 10 November, 2023\n- Minimum tenancy term is 12 months\n- Maximum number of tenants is 3\n- Students welcome to enquire\n- No Pets, sorry\n- No Smokers\n- Family Friendly\n- Bills not included\n- No Parking Available\n- No Garden Access\n- EPC Rating: C\n\n If calling, please quote reference: 1836452 \n\nFees:\nYou will not be charged any admin fees.\n\n\n ** Contact today to book a viewing and have the landlord show you round! ** \nRequest Details form responded to 24/7, with phone bookings available 9am-9pm, 7 days a week.","title":"2 bedroom flat","available":"Now","price":"£2,575 pcm","agency":"OpenRent, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/86519178#/?channel=RES_LET","address":"Leyland House, Hale Street, Poplar, East India Dock, London, E14 0BT","description":"Jack Barclay Estate London are happy to offer a spacious 2 double bedroom apartment in Canary Wharf one bathroom and separate kitchen to lounge. \nThe property has been refurnished to a high standard.\n\nLess than a two min's walk to Poplar DLR\nVictoria Park 2.7 miles   \nGreenwich Park.\nTower Bridge is 3.1 miles\nO2 Arena is 3.1 miles \nThe nearest airport is London City Airport, 3.7 miles","title":"2 bedroom flat","available":"Ask agent","price":"£2,232 pcm","agency":"Jack Barclay Estates, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/141591593#/?channel=RES_LET","address":"Meridian Place, Canary Wharf","description":"A bright two bedroom apartment on the first floor of this sought after development. This large apartment has two bathrooms, ample storage and a private balcony.\n\nMeridian Place is moments away from the bars and restaurants of South Quay, including the popular Lotus Floating Restaurant.","title":"2 bedroom flat","available":"Ask agent","price":"£2,197 pcm","agency":"Dexters, Canary Wharf Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/86508954#/?channel=RES_LET","address":"Arden Crescent, Canary Wharf","description":"A bright two bedroom apartment on the second floor of this dockside development. This apartment has open plan reception room, a private balcony and breathtaking views.\n\nQuay View is situated half a mile from Mudchute DLR and less than a mile from the bars, restaurants, shopping, facilities and offices at Canary Wharf.","title":"2 bedroom flat","available":"Ask agent","price":"£2,097 pcm","agency":"Waterview, Waterview Shad Thames Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/199k/198539/86508954/198539_32650627_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/86507448#/?channel=RES_LET","address":"Arden Crescent, Canary Wharf","description":"A bright two bedroom apartment on the second floor of this dockside development. This apartment has open plan reception room, a private balcony and breathtaking views.\n\nQuay View is situated half a mile from Mudchute DLR and less than a mile from the bars, restaurants, shopping, facilities and offices at Canary Wharf.","title":"2 bedroom flat","available":"Ask agent","price":"£2,097 pcm","agency":"Dexters, Canary Wharf Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/83k/82537/86507448/82537_32650521_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/140095199#/?channel=RES_LET","address":"41 Millharbour, London, E14","description":"**GAS, WATER & HEATING INCLUDED**\n\nLuxury 2 bedroom / 2 bath furnished apartment located on the 5th Floor of this dockside development with views across the courtyard. GAS, WATER & HEATING utilities included.\n\nAvailable now! Features include:\n\n– 2 double bedrooms\n\n– 2 bathrooms (one en-suite)\n\n– Private balcony\n\n– Open plan kitchen and reception\n\n– Integrated appliances\n\n– Furnished\n\n– 24hr concierge\n\n– On site Tesco Express\n\n– Walking distance to South Quay DLR\n\n– Less than 10 mins walk to Canary Wharf business district and shopping amenities\n\n– Close to restaurants, cafes and bars\n\n– Heating and Water utilities included\n\nDeposit: £3,115\n\nSorry, no pets\n\nEnergy Efficiency Rating: 81, Band – B\n\nCouncil tax band: E\n\nReference: 006612\n\nPlease note, by submitting an enquiry regarding this property you agree that we may send your details to the landlord of this property so they may contact you in order to answer any questions, or arrange a convenient viewing time. STRICTLY NO AGENT OR SUB-LETTING CALLS.","title":"2 bedroom apartment","available":"Now","price":"£2,700 pcm","agency":"The Online Letting Agents Ltd, Bury St Edmunds Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/116690603#/?channel=RES_LET","address":"Exmouth House, Cahir Street, London, E14","description":"Alliance London a pleased to bring to the market a spacious two double bedroom first floor flat within a purpose-built block close to the river Thames and a plethora of Isle of Dogs and Canary Wharf amenities and benefits from neutral decor and Juliet balcony.\n\nTransport links close to the property include Island Gardens and Mudchute DLR Station with Masthouse Terrace Pier (Thames Clipper services) also easily accessible. For the motorist, the propertys location provides quick and easy access to the A1206, A12, A13 and both the Blackwall and Limehouse Link Tunnels for travel to and from Canary Wharf, the City, central London and beyond.\n\nTo the outside of the property there is a development with residents parking and communal areas, staircase leading up to a communal walkway which leads to the private entrance into the property.\n\nThe property offers double glazing and gas central heating throughout, excellent storage. The property comprises of an open plan entrance hall with storage and computer room, modern bathroom, two double bedrooms (one with wardrobe), large open plan living/dining room and a spacious kitchen/breakfast room with storage.","title":"2 bedroom flat","available":"20/11/2024","price":"£2,000 pcm","agency":"Alliance London, London Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/78k/77148/116690603/77148_2001649_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/86426430#/?channel=RES_LET","address":"Arnhem Place, Canary Wharf","description":"A bright two bedroom apartment on the third floor of this secure, gated development. This river facing apartment has a private balcony, large reception room and benefits from recently updated fittings.\n\nNew Atlas Wharf is moments from the amenities of Canary Wharf. The shops, bars and restaurants of West India Quay are also close by. Crossharbour DLR is 0.6 miles from the property and offers direct travel into Bank via Canary Wharf in 15 minutes.","title":"2 bedroom flat","available":"Ask agent","price":"£2,700 pcm","agency":"Waterview, Waterview Shad Thames Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/199k/198539/86426430/198539_32645504_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/86424996#/?channel=RES_LET","address":"Arnhem Place, Canary Wharf","description":"A bright two bedroom apartment on the third floor of this secure, gated development. This river facing apartment has a private balcony, large reception room and benefits from recently updated fittings.\n\nNew Atlas Wharf is moments from the amenities of Canary Wharf. The shops, bars and restaurants of West India Quay are also close by. Crossharbour DLR is 0.6 miles from the property and offers direct travel into Bank via Canary Wharf in 15 minutes.","title":"2 bedroom flat","available":"Ask agent","price":"£2,700 pcm","agency":"Dexters, Canary Wharf Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/83k/82537/86424996/82537_32645445_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/140613353#/?channel=RES_LET","address":"1 Fairmont Avenue London E14","description":"The apartment has a spacious open plan reception room with access to a large terrace with spectacular river views, separate fitted kitchen, two double bedrooms (one within en-suite) and modern main bathroom. The property is available furnished and has been well maintained throughout. Property also comes with secure parking.\n\n\nNew Providence Wharf Development offers a 24 hour concierge service, secure parking, leisure facilities which include a sauna, swimming pool and gym. It is also close to all the amenities of Docklands with its many exciting shops, bars, restaurants exhibitions.","title":"2 bedroom apartment","available":"17/11/2023","price":"£2,800 pcm","agency":"Cluttons, Wapping - Lettings Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/58k/57124/140613353/57124_P212436_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/86360163#/?channel=RES_LET","address":"Boardwalk Place, Canary Wharf E14","description":"Wonderful waterside two bedroom, two bathroom apartment with a balcony in a contemporary development overlooking Blackwall Basin in Canary Wharf. The apartment comprises a fully integrated kitchen, ample living room, a master bedroom with an en suite bathroom, a further double bedroom and a bathroom. \n\nResidents will also have access to a 24-hour concierge service. There are amenities located nearby including restaurants, cafés and shops. The development is located near to the transport links and amenities of Canary Wharf.\n\nDeposit: Equivalent to 5 weeks’ rent\nCouncil: Tower Hamlets, Band F\nClient Money Protection (CMP) provided by: UKALA\nThe Property Ombudsman Scheme, Membership No: T02100","title":"2 bedroom apartment","available":"Now","price":"£2,600 pcm","agency":"Chase Evans, Canary Wharf Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/29k/28238/86360163/28238_P66937_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/140785520#/?channel=RES_LET","address":"Horizons Tower, Canary Wharf, E14","description":"The Property Company are delighted to offer this stunning apartment in Horizons Tower in Canary Wharf E14. \n\nThe property consist of two large double bedrooms, two bathrooms (1 en-suite to master room), large open plan kitchen, reception and dining area with a balcony benefiting from partial views of both the River Thames 7 Canary Wharf. there are floor to ceiling windows throughout and the block comes with 24 hour concierge and residents only gymnasium. \n\nThe property is offered largely furnished and exclusive of all bills. contact our experienced lettings team today to book in your viewing.\n\nTenancy Length: 12-36 Months (subject to negotiation)","title":"2 bedroom flat","available":"22/12/2023","price":"£2,495 pcm","agency":"The Property Company, Crouch End Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/140775707#/?channel=RES_LET","address":"9 Province Square, Canary Wharf, London","description":"With 2 bedrooms, an open plan kitchen and living room, 2 bathrooms and is situated on the 15th floor with Canary Wharf and dock views.\n\nOffered furnished and benefits from the use of a day concierge.\n\nAvailable 17th November.\n\nWalking distance to Blackwall DLR station and into the Canary Wharf estate, where you'll find bars, restaurants, shops and the Elizabeth Line/DLR and Jubilee line stations.","title":"2 bedroom apartment","available":"18/11/2023","price":"£2,500 pcm","agency":"Love Your Home, Temple Hill Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/236k/235565/140775707/235565_32636926_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/140765339#/?channel=RES_LET","address":"Fairmont Avenue, Canary Wharf","description":"An 11th floor two bedroom two bathroom apartment with direct river views. The apartment is in immaculate condition throughout and benefits from wood flooring, built-in storage, a private balcony and residents facilities.\n\nNew Providence Wharf is situated a short walk from many popular restaurants including Hawksmoor and Dishoom.","title":"2 bedroom flat","available":"Ask agent","price":"£2,799 pcm","agency":"Dexters, Canary Wharf Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/83k/82537/140765339/82537_32636351_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/140690252#/?channel=RES_LET","address":"Antillies Bay, Lawn House Close","description":"Dock facing two bedroom, two bathroom (en-suite to master) apartment situated in the Antilles Bay development. The property is furnished and presented in excellent condition. Internal accommodation measures approximately (87msq/936sq ft) and includes a large lounge and a separate fully fitted kitchen. The living room leads onto a large balcony affording views of South Dock and Canary Wharf. A secure underground parking bay is included in the rent.","title":"2 bedroom flat","available":"Now","price":"£2,650 pcm","agency":"Fisks Ltd, London Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/39k/38558/140690252/38558_32630694_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141581306#/?channel=RES_LET","address":"Falcon Way, LONDON, E14","description":"A spacious two bedroom apartment on ground floor and 1st floor. Apartment also offers fitted kitchen, allocated parking, and balcony offering views of the dock view within walking distance to Mudchute DLR & Asda supermarket.\n\n\n\nProperty additional info\n\ntotal: 60","title":"2 bedroom semi-detached house","available":"17/01/2024","price":"£2,253 pcm","agency":"CHAMPS UK Property Asset Management, London Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/192k/191750/141581306/191750_champs_592560958_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/86527215#/?channel=RES_LET","address":"Lanterns Court, London, E14","description":"Property Reference: 1790249.\n\nProperty Features \nStylish two bedroom flatOne large room, one small roomIdeal for a couple and familiesLocated in a striking dockland developmentOpen-plan living room/kitchenBalcony with far reach views \nCCTV/Video Phone Entry/Alarm SystemPresented in excellent conditionA short distance to Canary Wharf\nProperty descriptionThis stunning two bedroom apartment at the ever popular Lanterns Court development conveniently located just walking distance to Canary Wharf. The apartment consists of a contemporary open plan living room with fitted kitchen area, family bathroom and two double bedrooms.One large bedroom and one small bedroom. The property further benefits from private balcony, double glazing and video entry-system \n\n\nSummary & Exclusions:\n- Rent Amount: £2,350.00 per month (£542.31 per week)\n- Deposit / Bond: £2,711.53\n- 2 Bedrooms\n- 1 Bathrooms\n- Property comes furnished\n- Available to move in from 16 January, 2024\n- Minimum tenancy term is 6 months\n- Maximum number of tenants is 3\n- Students welcome to enquire\n- No Pets, sorry\n- No Smokers\n- Family Friendly\n- Bills not included\n- No Parking Available\n- No Garden Access\n- EPC Rating: B\n\n If calling, please quote reference: 1790249 \n\nFees:\nYou will not be charged any admin fees.\n\n\n ** Contact today to book a viewing and have the landlord show you round! ** \nRequest Details form responded to 24/7, with phone bookings available 9am-9pm, 7 days a week.","title":"2 bedroom flat","available":"16/01/2024","price":"£2,350 pcm","agency":"OpenRent, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/140081375#/?channel=RES_LET","address":"Province Square, Canary Wharf, E14","description":"This contemporary and stylish apartment is set on the 18th floor of Streamlight and is offered on a fully furnished basis. The development is modern and ideally located of Canary Wharf and the City with excellent transport links. Ideal for any professional working in Canary Wharf or the City. \r\n\nOffering double bedrooms, contemporary bathrooms, large and spacious open plan living area, and a private balcony. The apartment has been finished to a high standard and benefits from views of Canary Wharf. Other benefits are 24-hour concierge and lift. \r\n\nStreamlight is in the Blackwall area which is one of the residential hubs of the Canary Wharf. With excellent transport links and within walking distance to Canary Wharf this is the place to be. Canary Wharf has a lot of offer professionals living in the area with a wide variety of shops, bars, and restaurants, along with excellent transport links with direct trains into Central London. Blackwall also has a DLR station which has direct trains to Bank station making this an idea place to live for professionals working in Canary Wharf and the City.","title":"2 bedroom apartment","available":"Now","price":"£2,575 pcm","agency":"Benham & Reeves, Canary Wharf Logo","floorplan":true,"floorplan_img":"https://media.rightmove.co.uk/dir/86k/85774/140081375/85774_000002792_FLP_00_0000.jpeg"},{"link":"https://www.rightmove.co.uk/properties/141696641#/?channel=RES_LET","address":"Schooner Close, London, E14","description":"Property Reference: 1827455.\n\nA delightful two double bedroom maisonette apartment boasting over 990 Sq Ft (91 SqM) situated in a quiet, well-maintained and high-demanded neighbourhood.  \n\n\nThe flat comprises a spacious reception room, a generous private garden, a fully integrated kitchen, a garage with internal access that can be used as both utility room and storeroom, a separate WC downstairs; two large double bedrooms (with one ensuite and a private balcony) and a family bathroom upstairs. Designated parking slot in front of the garage for private use and off street parking also available upon request of extra parking permit.  \n\nThe flat is superbly located with easy access to the city from Island Garden / Crossharbour DLR station.  The neighbourhood is within the Isle of Dogs on the banks of the River Thames (close to the Thames River Path) and moments from Mudchute Park, while the fantastic selection of shops, bars and restaurants on offer in Canary Wharf are close by.  \n\n\nThe property comes fully furnished.  Families / professionals are welcome. Students would be considered upon meeting certain criteria only.  No indoor smoking is allowed.\n\nSummary & Exclusions:\n- Rent Amount: £2,495.00 per month (£575.77 per week)\n- Deposit / Bond: £2,878.84\n- 2 Bedrooms\n- 2 Bathrooms\n- Property comes furnished\n- Available to move in from 04 November, 2023\n- Minimum tenancy term is 12 months\n- Maximum number of tenants is 2\n- Students welcome to enquire\n- No Pets, sorry\n- Smokers considered\n- Family Friendly\n- Bills not included\n- Property has parking\n- Property has garden access\n- EPC Rating: C\n\n If calling, please quote reference: 1827455 \n\nFees:\nYou will not be charged any admin fees.\n\n\n ** Contact today to book a viewing and have the landlord show you round! ** \nRequest Details form responded to 24/7, with phone bookings available 9am-9pm, 7 days a week.","title":"2 bedroom maisonette","available":"Now","price":"£2,495 pcm","agency":"OpenRent, London Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/68741964#/?channel=RES_LET","address":"Newport Ave, E14","description":"We are pleased to offer this immaculate two bedroom, two bathroom property situated in the peaceful residential area of Newport Avenue.\n\nThe property is situated on the third floor in Newport Avenue, a secure development with porter services. The property is a generous size with a south facing balcony with partial views of the O2. The two bedoroms are a good size, with the master benefitting from a en-suite bathroom. There is a separate kitchen with a hob and integrated appliances.\n\nSecure parking available for an additional £100 per month\n\nThis property is available with a Deposit Free option which means that instead of paying a traditional five weeks security deposit, you pay a fee of one weeks rent + VAT (subject to a minimum of £120 + VAT) to become a member of a deposit free renting scheme which significantly reduces the up-front costs. This fee is non-refundable and is not a deposit so cannot be used towards covering the cost of any future damage.","title":"2 bedroom flat","available":"28/11/2023","price":"£2,197 pcm","agency":"Felicity J Lord, Canary Wharf Lettings Logo","floorplan":false,"floorplan_img":null},{"link":"https://www.rightmove.co.uk/properties/137636261#/?channel=RES_LET","address":"Limeharbour, London, E14 9LU","description":"Well located near to the centre of Canary Wharf, this stylish two bedroomed flat furnished to a high specification offers a modern lifestyle with a west facing balcony, concierge service and a secure setting on the fourteenth floor of a popular development. The property comprises sizeable reception room/kitchen with smart fitted units with integrated appliances, master bedroom with en suite shower room, second double bedroom and a chic three piece bathroom suite.Location: City Tower lies moments from Mudchute Park and the Millwall Docks, while a cosmopolitan range of shops and restaurants can be found at the nearby Canary Wharf complex. Crossharbour Station (DLR) is close by and Canary Wharf Underground Station provides the Jubilee line.Term: LongtermFurnishings: FurnishedLocal authority: Tower hamletsCOUNCIL TAX BAND: ECOUNCIL TAX: £1,857.77Total Sq Ft: 850 ApproxEPCDDisclaimer: Ashley King endeavour to advertise accurate representations of properties in descriptions, virtual tours and floor plans, however, they are intended as a guide only and interested parties must satisfy themselves by undertaking a personal inspection.","title":"2 bedroom flat","available":"Now","price":"£2,500 pcm","agency":"Ashley King, Docklands Logo","floorplan":false,"floorplan_img":null}]